[
    {
        "id": "345fhg",
        "language": "arabic",
        "title": "ممارسات سادية و تعذيبًا متكررًا حتى الموت القبض على سفاح التجمع يهز مصر",
        "description": "رجل متهم بممارسات سادية وغرف عازلة للصوت يتم القبض عليه في مصر.",
        "content": "اهتزت الجماعة المصرية عندما انتشر خبر القبض على رجل يُلقب بـ 'سفاح السيوف'. الجاني، الذي تم التعرف عليه باسم كريم، مدرس لغات يبلغ من العمر 46 عامًا في مدرسة دولية، تم القبض عليه بعد سلسلة من الاكتشافات المروعة.\n\nوفقًا للتحقيقات الأولية، استدرج كريم ضحاياه، بما في ذلك نساء الليل، إلى شقته في التجمع الخامس، حيث ارتكب أفعالًا شنيعة داخل غرفة مصممة خصيصًا لتكون عازلة للصوت. وتضمنت الطبيعة السادية للجرائم تعذيبًا متكررًا حتى الموت.\n\nاستغل الجاني منصات التواصل الاجتماعي لجذب ضحاياه ونفذ جرائمه بدقة مرعبة. تمكنت قوات الأمن من القبض عليه بعد هروب قصير أثناء إعادة تمثيل مسرح الجريمة. ويُؤكد حاليًا أن عدد الضحايا ستة، مع جهود مستمرة لتحديد مكان الجثث المتبقية.\n\nألقت هذه القضية الضوء على الجانب المظلم من الجرائم التي تُرتكب في العزلة، مما أثار تساؤلات حول تدابير الأمان والحماية الموجودة داخل المجتمع.",
        "url": "",
        "image": "/images/safahElTag.jpg",
        "publishedAt": "2024-05-25T16:33:00Z",
        "source": {
            "name": "أخبار أهل مصر",
            "url": ""
        }
    },
    {
        "title": "Mavericks Edge Out Timberwolves in a Nail Biting Finish",
        "description": "Luka Doncic leads the Mavericks to a thrilling one-point victory over the Timberwolves.",
        "content": "In a game that kept fans on the edge of their seats until the final buzzer, the Dallas Mavericks triumphed over the Minnesota Timberwolves with a score of 109-108. Luka Doncic's triple-double was the highlight of the night, as he amassed 32 points, 13 rebounds, and 10 assists, showcasing his all-around game and clutch performance in the fourth quarter.\n\nThe Timberwolves, despite a strong showing, fell just short. Naz Reid's 23 points led the team, but it wasn't enough to overcome the Mavericks' late-game execution. The match was a testament to the competitive spirit of both teams, with the Mavericks ultimately securing the win on the road.\n\nThis victory not only adds to the Mavericks' impressive season record but also cements Luka Doncic's status as one of the premier players in the league.",
        "url": "https://www.mavsmoneyball.com/2024/5/24/24164436/mavericks-timberwolves-final-score-109-108-game-2-recap-dallas-minnesota-luka-doncic-kyrie-irving",
        "image": "https://bwbqtabrouysgzhzamfy.supabase.co/storage/v1/object/public/news_rocket/bbminosota.jpg?t=2024-05-30T11%3A24%3A58.804Z",
        "publishedAt": "2024-05-25T22:00:00Z",
        "source": {
            "name": "Mavs-Moneyball",
            "url": "https://www.mavsmoneyball.com/2024/5/24/24164436/mavericks-timberwolves-final-score-109-108-game-2-recap-dallas-minnesota-luka-doncic-kyrie-irving"
        },
        "id": "Mavericks-Edge-Out-Timberwolves-in-a-Nail-Biting-Finish"
    },
    {
        "title": "Uvalde school shooting: Families sue Meta, video game maker on 2nd anniversary",
        "description": "The families of a group of victims of the Uvalde school shooting have announced new lawsuits against Instagram parent company Meta Platforms, the maker of the video game Call of Duty and the gun company that made the assault rifle used in the shooting.",
        "content": "AUSTIN, Texas (AP) — Families in Uvalde took more legal action Friday on the second anniversary of the Robb Elementary School attack, suing Meta Platforms, which owns Instagram, and the maker of the video game Call of Duty over claims the companies b... [4327 chars]",
        "url": "https://apnews.com/article/uvalde-shooting-elementary-anniversary-texas-a20e7fefa9d66058a8ff6611fa808df8",
        "image": "https://dims.apnews.com/dims4/default/4a8eb4b/2147483647/strip/true/crop/5038x2834+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F75%2F25dacf32b62080315e89fd272828%2F8e54aebe0e7e4463a8af82cadc78bfdb",
        "publishedAt": "2024-05-25T02:38:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "13eeb7"
    },
    {
        "title": "Morgan Spurlock, ‘Super Size Me’ documentarian, dead at 53",
        "description": "Morgan Spurlock, the filmmaker and former CNN series host whose McDonald’s documentary “Super Size Me” was nominated for an Academy Award, died of cancer complications Thursday, according to his family.",
        "content": "CNN —\nMorgan Spurlock, the filmmaker and former CNN series host whose McDonald’s documentary “Super Size Me” was nominated for an Academy Award, died of cancer complications Thursday, according to his family.\nSpurlock, who was 53, died in New York, s... [2973 chars]",
        "url": "https://www.cnn.com/2024/05/24/entertainment/morgan-spurlock-death/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/120312083333-morgan-spurlock-executive-producer.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-25T02:09:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1c3ab1"
    },
    {
        "title": "Prosecutors seek to bar Trump in classified files case from statements endangering law enforcement",
        "description": "Federal prosecutors have asked the judge overseeing the classified documents case against Donald Trump to bar the former president from public statements that “pose a significant, imminent, and foreseeable danger to law enforcement agents” participating in the prosecution.",
        "content": "WASHINGTON (AP) — Federal prosecutors on Friday asked the judge overseeing the classified documents case against Donald Trump to bar the former president from public statements that “pose a significant, imminent, and foreseeable danger to law enforce... [3588 chars]",
        "url": "https://apnews.com/article/trump-classified-documents-fbi-d52b7468d93712dd86cbb8fe304d4b64",
        "image": "https://dims.apnews.com/dims4/default/a53b74c/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F86%2Fd44256385ad05577d6c4000a0e5b%2Fadfc78b82b274c65bf25959e63293b67",
        "publishedAt": "2024-05-25T01:34:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1dee73"
    },
    {
        "title": "See Millie Bobby Brown and Jake Bongiovi Step Out After Their Wedding",
        "description": "Millie Bobby Brown and her new husband Jake Bongiovi were all smiles during an outing in The Hamptons following news that they got married last weekend. See photos of the newlyweds.",
        "content": "Watch : Millie Bobby Brown Marries Jake Bongiovi in Private Ceremony\nMillie Bobby Brown and Jake Bongiovi are anything but strangers.\nIn fact, the Stranger Things star and the model—who is the son of Jon Bon Jovi—looked all loved up as they stepped o... [865 chars]",
        "url": "https://www.eonline.com/news/1402406/millie-bobby-brown-and-jake-bongiovis-first-pics-after-wedding-prove-their-romance-is-an-11-out-of-10",
        "image": "https://akns-images.eonline.com/eol_images/Entire_Site/2024424/rs_1200x1200-240524171931-1200.millie-bobby-brown-jake-bongiovi-post-wedding-1.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
        "publishedAt": "2024-05-25T00:39:00Z",
        "source": {
            "name": "E! NEWS",
            "url": "https://www.eonline.com"
        },
        "id": "174607"
    },
    {
        "title": "Louisiana governor signs bill making two abortion drugs controlled dangerous substances",
        "description": "Louisiana Gov. Jeff Landry has signed a first-of-its-kind bill to classify two abortion-inducing drugs as controlled and dangerous substances.",
        "content": "NEW ORLEANS (AP) — First-of-its-kind legislation that classifies two abortion-inducing drugs as controlled and dangerous substances was signed into law Friday by Louisiana Gov. Jeff Landry.\nThe Republican governor announced his signing of the bill in... [2911 chars]",
        "url": "https://apnews.com/article/abortion-pills-louisiana-controlled-dangerous-substances-0984bfed536a5110997dd9c8264bf9e3",
        "image": "https://dims.apnews.com/dims4/default/1b14af0/2147483647/strip/true/crop/6091x3426+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F18%2F0dbce33864540b9eda6a37792cdb%2Fcc836281a96d4d26a551d6ab9b472185",
        "publishedAt": "2024-05-24T23:57:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "17e311"
    },
    {
        "title": "Millie Bobby Brown and husband Jake Bongiovi proudly flaunt their wedding bands as the giddy newlyweds are seen for the FIRST TIME since confirming they've tied the knot",
        "description": "A source informed DailyMail.com this Friday that Jake and Millie exchanged vows in a private ceremony in the United States last week. Jon was in attendance at the ceremony.",
        "content": "Advertisement\nMillie Bobby Brown and Jake Bongiovi were spotted in the Hamptons on Friday - in their first sighting since their secret wedding.\nThe Stranger Things actress, 20, was luminous with marital bliss, showing off her diamond sparkler and thr... [7761 chars]",
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13458117/Millie-Bobby-Brown-Jake-Bongiovi-wedding-secretly-married.html",
        "image": "https://i.dailymail.co.uk/1s/2024/05/25/00/85319203-0-image-m-14_1716593213903.jpg",
        "publishedAt": "2024-05-24T23:30:28Z",
        "source": {
            "name": "Daily Mail",
            "url": "https://www.dailymail.co.uk"
        },
        "id": "1945a4"
    },
    {
        "title": "Three missionaries, including American couple, killed by gang in Haiti",
        "description": "Three missionaries, including a married couple from the US, were killed in Haiti’s capital, Port-au-Prince, on Thursday evening.",
        "content": "CNN —\nThree missionaries, including a married couple from the US, were killed in Haiti’s capital, Port-au-Prince, on Thursday evening.\nDavy and Natalie Lloyd “were attacked by gangs this evening and were both killed,” Natalie Lloyd’s father, Missouri... [6725 chars]",
        "url": "https://www.cnn.com/2024/05/24/us/american-missionary-couple-haiti/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/444137819-10228088968224495.JPG?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-24T22:19:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1cd6d6"
    },
    {
        "title": "Millie Bobby Brown And Jake Bongiovi Just Got Married",
        "description": "The couple were wed in front of a small group of friends and family, including Bongiovi's dad, singer Jon Bon Jovi.",
        "content": "LOADING ERROR LOADING\nActor Millie Bobby Brown just added another “B” to her name: “Bongiovi.”\nThe 20-year-old “Stranger Things” star married Jake Bongiovi, 22, in a private ceremony last weekend, according to People magazine.\nA source told the Sun n... [1068 chars]",
        "url": "https://www.huffpost.com/entry/millie-bobby-brown-jake-bongiovi-married_n_6650fd4fe4b0c292ea04dc0e",
        "image": "https://img.huffingtonpost.com/asset/6650fdce23000034008203bd.jpeg?cache=y6A1YOLfWI&ops=1200_630",
        "publishedAt": "2024-05-24T22:14:14Z",
        "source": {
            "name": "HuffPost",
            "url": "https://www.huffpost.com"
        },
        "id": "115cdb"
    },
    {
        "title": "Man insults judge who sentenced him to 12 years in prison for attacking police during Capitol riot",
        "description": "A New Jersey electrician who repeatedly attacked police officers during the Jan. 6, 2021, siege at the U.S. Capitol has been sentenced to 12 years in prison.",
        "content": "WASHINGTON (AP) — A New Jersey electrician who repeatedly attacked police officers during the Jan. 6, 2021, siege at the U.S. Capitol was sentenced on Friday to 12 years in prison by a judge who called him “a menace to our society.”\nChristopher Josep... [4336 chars]",
        "url": "https://apnews.com/article/christopher-quaglin-sentencing-capitol-riot-e628b2f9898a64a7a557dae1fe796e39",
        "image": "https://dims.apnews.com/dims4/default/9306043/2147483647/strip/true/crop/1642x924+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fc9%2F418c27ecde099c8267177cb29207%2F54b7023f61eb4f48be034dbffa9db4b1",
        "publishedAt": "2024-05-24T22:14:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1ae2e5"
    },
    {
        "title": "American detained in Turks and Caicos gets 52-week suspended sentence",
        "description": "The first of the five Americans detained and charged with carrying ammunition in Turks and Caicos will learn his fate during a sentencing hearing.",
        "content": "Close Thank you for signing up! Subscribe to more newsletters here.\n(NewsNation) — The first of five Americans who were detained and charged with carrying ammunition in their luggage was sentenced and fined Friday.\nBryan Hagerich, 39, was handed a 52... [6034 chars]",
        "url": "https://www.newsnationnow.com/world/bryan-hagerich-turks-and-caicos-sentencing/",
        "image": "https://www.newsnationnow.com/wp-content/uploads/sites/108/2024/05/snapshot-12-1-e1716570667126.jpg?w=1280",
        "publishedAt": "2024-05-24T22:05:17Z",
        "source": {
            "name": "NewsNation Now",
            "url": "https://www.newsnationnow.com"
        },
        "id": "1e34d4"
    },
    {
        "title": "Iran President Raisi: Days of funeral ceremonies begin as investigators probe helicopter crash",
        "description": "Iran will kick off funeral ceremonies for the late Iranian president Ebrahim Raisi on Tuesday following his death in a helicopter crash as authorities probe what caused the aircraft to smash into the side of a remote mountainside.",
        "content": "CNN —\nFuneral ceremonies are set to begin on Tuesday for the late Iranian President Ebrahim Raisi following his death in a helicopter crash, as authorities probe what caused the aircraft to smash into the side of a remote mountainside during foggy we... [5486 chars]",
        "url": "https://www.cnn.com/2024/05/21/world/iran-begins-days-of-funeral-ceremonies-for-president-raisi-as-investigators-probe-helicopter-crash/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-05-20t002427z-286456576-rc2ht7aaxl8r-rtrmadp-3-iran-security-president.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-21T05:48:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "19369d"
    },
    {
        "title": "Slain leader of failed DR Congo coup Christian Malanga sold cars in Utah when he lived in the US",
        "description": "Christian Malanga was killed during an attack on the presidential palace after he resisted arrest, a spokesperson with the Democratic Republic of Congo army told outlets Sunday.",
        "content": "The slain leader of a failed coup attempt to overthrow the Congolese president used to live in the United States where he was a car dealer in Utah after resettling as a teen refugee decades ago.\nChristian Malanga was killed during an attack on the pr... [3827 chars]",
        "url": "https://nypost.com/2024/05/21/world-news/slain-leader-of-failed-dr-congo-coup-christian-malanga-sold-cars-in-utah-when-he-lived-in-the-us/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/congo-coup.jpg?quality=75&strip=all&1716250259&w=1024",
        "publishedAt": "2024-05-21T04:25:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "1b0ac4"
    },
    {
        "title": "Hush money trial: Trump witness Costello back on the stand after admonishment",
        "description": "A defense witness in Donald Trump’s hush money case whom the judge threatened to remove from the trial over his behavior will return to the stand Tuesday as the trial nears its end.",
        "content": "NEW YORK (AP) — A defense witness in Donald Trump’s hush money case whom the judge threatened to remove from the trial over his behavior will return to the stand Tuesday as the trial nears its end.\nTrump’s lawyers are hoping Robert Costello’s testimo... [4760 chars]",
        "url": "https://apnews.com/article/trump-trial-hush-money-robert-costello-b1beb56a666c398ae5393ede16c326da",
        "image": "https://dims.apnews.com/dims4/default/a63806f/2147483647/strip/true/crop/3936x2214+0+27/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fc6%2Fb2f4319f9567a7e5ae6fb0d22ad8%2F826f2ce8a19140c7b801f2e5d10cf110",
        "publishedAt": "2024-05-21T04:06:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1b3de8"
    },
    {
        "title": "Jennifer Lopez Rocks Wedding Ring on Carpet Amid Ben Affleck Rumors",
        "description": "Jennifer Lopez was spotted with her wedding ring from husband Ben Affleck amid rumors that the couple are experiencing marital troubles. See her on the red carpet at the Atlas premiere.",
        "content": "Watch : Jennifer Lopez and Ben Affleck Spotted Together Amid Breakup Rumors\nThis is Jennifer Lopez...now.\nAmid rumors that her marriage to Ben Affleck is on the rocks, the multi-hyphenate performer stepped out with her wedding ring on full display at... [794 chars]",
        "url": "https://www.eonline.com/news/1402026/jennifer-lopez-puts-her-wedding-ring-on-display-on-red-carpet-amid-ben-affleck-breakup-rumors",
        "image": "https://akns-images.eonline.com/eol_images/Entire_Site/2024420/cr_1200x1200-240520194336-GettyImages-2153383696.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
        "publishedAt": "2024-05-21T02:57:00Z",
        "source": {
            "name": "E! NEWS",
            "url": "https://www.eonline.com"
        },
        "id": "1cb09e"
    },
    {
        "title": "Li Auto shares plunge in HK on disappointing earnings, delay of more BEV launches",
        "description": "Li Auto's BEV endeavors appear to be facing structural challenges as transferring its EREV success to BEV is not so straightforward, Deutsche Bank said.",
        "content": "Li Auto's BEV endeavors appear to be facing structural challenges as transferring its EREV success to BEV is not so straightforward, Deutsche Bank said.\nLi Auto (NASDAQ: LI) shares traded in Hong Kong tumbled in early trading on Tuesday, following th... [3501 chars]",
        "url": "https://cnevpost.com/2024/05/21/li-auto-shares-plunge-in-hk/",
        "image": "https://img.cnevpost.com/2024/05/21104022/2024052102402259.jpg",
        "publishedAt": "2024-05-21T02:43:00Z",
        "source": {
            "name": "CnEVPost",
            "url": "https://cnevpost.com"
        },
        "id": "170b77"
    },
    {
        "title": "Nash congratulates Podz for ‘well-deserved' NBA All-Rookie honors",
        "description": "Fellow Santa Clara University alum Steve Nash congratulated Brandin Podziemski on his selection to the 2023-24 NBA All-Rookie First Team on Monday.",
        "content": "On Monday, Warriors guard Brandin Podziemski found out he earned 2023-24 NBA All-Rookie First Team honors in one of the coolest ways possible.\nTwo-time NBA MVP Steve Nash, who also was a two-time West Coast Conference Player of the Year at Podziemski... [1950 chars]",
        "url": "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/steve-nash-brandin-podziemski-all-rookie-video/1736752/",
        "image": "https://media.nbcsportsbayarea.com/2024/05/steve-nash-brandin-podziemski-GettyImages-1855953739.jpg?quality=85&strip=all&resize=1200%2C675",
        "publishedAt": "2024-05-21T02:27:29Z",
        "source": {
            "name": "NBC Sports Bay Area",
            "url": "https://www.nbcsportsbayarea.com"
        },
        "id": "1f53d7"
    },
    {
        "title": "Caitlin Clark earns costly technical in Fever loss to Sun",
        "description": "Caitlin Clark’s intensity got her into a bit of trouble in the fourth quarter as the Indiana Fever star was putting on an offensive clinic in the game’s final period.",
        "content": "Caitlin Clark’s intensity got her into a bit of trouble in the fourth quarter as the Indiana Fever star was putting on an offensive clinic in the game’s final period.\nIndiana dropped its fourth consecutive game – a close 88-84 loss to the Connecticut... [3334 chars]",
        "url": "https://nypost.com/2024/05/20/sports/caitlin-clark-earns-costly-technical-in-fever-loss-to-sun/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/newspress-collage-kdrwdzssr-1716256209616.jpg?quality=75&strip=all&1716241885&w=1024",
        "publishedAt": "2024-05-21T02:00:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "1d08d6"
    },
    {
        "title": "Researchers studying ‘doomsday glacier’ make worrying discovery",
        "description": "Antarctica's \"doomsday glacier,\" referred to as such for its potential to dramatically raise global sea levels, is melting faster than we thought thanks to warmer sea water passing below it, according to a new study.",
        "content": "(NEXSTAR) – Antarctica’s “doomsday glacier,” referred to as such for its potential to dramatically raise global sea levels, is melting faster than we thought thanks to warmer sea water passing below it, according to a new study.\nThe researchers, led ... [2609 chars]",
        "url": "https://thehill.com/homenews/nexstar_media_wire/4675792-researchers-studying-doomsday-glacier-make-worrying-discovery/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2024/05/GettyImages-2052152200.jpg?w=1280",
        "publishedAt": "2024-05-21T02:00:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "107ea8"
    },
    {
        "title": "Australia, New Zealand send planes to evacuate nationals from New Caledonia",
        "description": "Violent unrest that has beset the French Pacific archipelago where indigenous people have long sought independence from France.",
        "content": "SYDNEY (AP) — The Australian and New Zealand governments announced Tuesday they were sending planes to evacuate their nationals from violence-wracked New Caledonia.\nAustralian Foreign Minister Penny Wong confirmed Australia had received clearance fro... [2282 chars]",
        "url": "https://apnews.com/article/australia-new-zealand-new-caledonia-australia-8fb1ad85f675720ed77c03b718533bd2",
        "image": "https://dims.apnews.com/dims4/default/3b6d94b/2147483647/strip/true/crop/2071x1165+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F05%2F6df9b1624d6fe580ecb19f665b21%2Fb88af04b7ce745a3b09a5001988f37cb",
        "publishedAt": "2024-05-21T01:43:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "16d7be"
    },
    {
        "title": "Julian Assange’s Extradition Appeal Hearing: What Could Happen?",
        "description": "A hearing on Monday will determine whether Julian Assange has any more recourse in the British courts to appeal his extradition to the United States.",
        "content": "Update: A London court ruled on Monday that Julian Assange could appeal his extradition to the United States, a move that extends his long-running legal battle in the British courts.\nA British court is set to make a final decision after a Monday hear... [584 chars]",
        "url": "https://www.nytimes.com/2024/05/20/world/europe/julian-assange-extradition-appeal-hearing.html",
        "image": "https://static01.nyt.com/images/2024/05/20/world/20uk-assange-explainer2/20uk-assange-explainer2-facebookJumbo.jpg",
        "publishedAt": "2024-05-21T00:36:14Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1f8fc5"
    },
    {
        "title": "China’s economic recovery diverges as factory output jumps and retail sales lag",
        "description": "Beijing’s industrial policy is increasingly driving trade tensions with US and EU",
        "content": "Print this page\nSimply sign up to the Chinese economy myFT Digest -- delivered directly to your inbox.\nChina’s industrial production rose more than expected last month, but retail sales grew more slowly in a sign that weak consumer sentiment was weig... [3270 chars]",
        "url": "https://www.ft.com/content/6dda7fcb-e7ab-481f-b522-88465568c4d7",
        "image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__origami%2Fservice%2Fimage%2Fv2%2Fimages%2Fraw%2Fhttps%253A%252F%252Fd1e00ek4ebabms.cloudfront.net%252Fproduction%252F6daabb94-8b7d-4c19-a51c-b17c60426879.jpg%3Fsource%3Dnext-article%26fit%3Dscale-down%26quality%3Dhighest%26width%3D700%26dpr%3D1?source=next-opengraph&fit=scale-down&width=900",
        "publishedAt": "2024-05-17T04:36:46Z",
        "source": {
            "name": "Financial Times",
            "url": "https://www.ft.com"
        },
        "id": "1f08d2"
    },
    {
        "title": "Severe storms kill at least 4 in Houston, knock out power to 900,000 homes and businesses",
        "description": "Severe thunderstorms have hit southeastern Texas for the second time this month, and Houston's mayor says at least four people are dead.",
        "content": "HOUSTON (AP) — Fast-moving thunderstorms pummeled southeastern Texas on Thursday for the second time this month, killing at least four people, blowing out windows in high-rise buildings, downing trees and knocking out power to more than 900,000 homes... [2569 chars]",
        "url": "https://apnews.com/article/houston-texas-severe-weather-storms-d14447267de0a8900e1475a8ad7ed8ba",
        "image": "https://dims.apnews.com/dims4/default/f7c3b9c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F9a%2F1b7679e9e5c742e0d515d136db0e%2F6e83049bac954afb8154560bdacf2155",
        "publishedAt": "2024-05-17T03:54:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "172269"
    },
    {
        "title": "2024 ACM Awards: Winners List",
        "description": "The 2024 ACM Awards were May 16. Here's the winners list.",
        "content": "The Academy of Country Music’s “party of the year” has come and gone! The 59th ACM Awards — which were broadcast live from the Ford Center at The Star in Frisco, Texas — on Thursday (May 16), started the evening with Luke Combs leading in nominations... [6026 chars]",
        "url": "https://www.billboard.com/music/awards/2024-acm-awards-winners-list-1235685091/",
        "image": "https://www.billboard.com/wp-content/uploads/2024/05/Lainey-Wilson-8-acm-2024-year-show-billboard-1548.jpg?w=1024",
        "publishedAt": "2024-05-17T03:19:18Z",
        "source": {
            "name": "Billboard",
            "url": "https://www.billboard.com"
        },
        "id": "17a5f0"
    },
    {
        "title": "Upside-down US flag flew at home of Justice Samuel Alito after 2020 election, New York Times reports",
        "description": "An upside-down American flag – a symbol used by some supporters of former President Donald Trump who challenged the legitimacy Joe Biden’s 2020 victory – hung outside the home of Supreme Court Justice Samuel Alito after the election, The New York Times reported Thursday.",
        "content": "CNN —\nAn upside-down American flag – a symbol used by some supporters of former President Donald Trump who challenged the legitimacy of Joe Biden’s 2020 victory – hung outside the home of Supreme Court Justice Samuel Alito after the election, The New... [2664 chars]",
        "url": "https://www.cnn.com/2024/05/16/politics/alito-upside-down-american-flag-house/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/fa8e161f-271a-41e2-aabb-6ef3a63cddef.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-17T02:00:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1507e4"
    },
    {
        "title": "Justice Alito's home flew flag upside down after Trump's 'Stop the Steal' claims, report says",
        "description": "An upside-down American flag was displayed outside the home of Supreme Court Justice Samuel Alito in January 2021, The New York Times reports.",
        "content": "WASHINGTON (AP) — An upside-down American flag, a symbol associated with former President Donald Trump’s false claims of election fraud, was displayed outside the home of Supreme Court Justice Samuel Alito in January 2021, The New York Times reported... [3385 chars]",
        "url": "https://apnews.com/article/supreme-court-flag-stop-steal-alito-trump-9a32d658f5c5baa2bacba25bce7c48cd",
        "image": "https://dims.apnews.com/dims4/default/2623046/2147483647/strip/true/crop/5088x2862+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F3f%2F098834b00228e9ec297a7ec54bba%2F1aa2b1e651614f8ab11d06e356ed7d0a",
        "publishedAt": "2024-05-17T01:53:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1c38ba"
    },
    {
        "title": "PGA Championship: Xander Schauffele ties major record again as Scottie Scheffler eagles first hole as a Dad",
        "description": "Only four times in the history of all four men’s major championships has a golfer shot 62. Xander Schauffele is now responsible for the last two.",
        "content": "CNN —\nOnly four times in the history of all four men’s major championships has a golfer shot 62. Xander Schauffele is now responsible for the last two.\nFor the second time in less than a year, the American shot the lowest round score in a major’s his... [4541 chars]",
        "url": "https://www.cnn.com/2024/05/16/sport/xander-schauffele-pga-championship-score-record-spt-intl/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2153243150.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-17T00:13:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "182211"
    },
    {
        "title": "Google hosted I/O 2024 Demo Slam, opens employee hackathon",
        "description": "I/O 2024 felt more like a conference by spanning two days. There was in fact a third day of I/O, with a new \"Demo Slam\" and hackathon",
        "content": "Compared to past years, I/O 2024 felt much more like a developer conference by spanning two days. There was in fact a third day of I/O, with Google hosting a new “Demo Slam” event just for employees today where an internal Gemini hackathon was announ... [1562 chars]",
        "url": "https://9to5google.com/2024/05/16/google-io-2024-demo-slam-hackathon/",
        "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2024/05/google-io-2024-demo-slam-hackathon.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "publishedAt": "2024-05-17T00:11:00Z",
        "source": {
            "name": "9to5Google",
            "url": "https://9to5google.com"
        },
        "id": "148843"
    },
    {
        "title": "At Justice Alito’s House, a ‘Stop the Steal’ Symbol on Display",
        "description": "An upside-down flag, adopted by Trump supporters contesting the Biden victory, flew over the justice’s front lawn as the Supreme Court was considering an election case.",
        "content": "After the 2020 presidential election, as some Trump supporters falsely claimed that President Biden had stolen the office, many of them displayed a startling symbol outside their homes, on their cars and in online posts: an upside-down American flag.... [1126 chars]",
        "url": "https://www.nytimes.com/2024/05/16/us/justice-alito-upside-down-flag.html",
        "image": "https://static01.nyt.com/images/2024/05/16/multimedia/00alito-house-gqcp/00alito-house-gqcp-facebookJumbo.jpg",
        "publishedAt": "2024-05-17T00:04:22Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "193b9c"
    },
    {
        "title": "Takeaways from Day 18 of the Trump hush money trial",
        "description": "Donald Trump attorney Todd Blanche raised his voice and flailed his arms at Michael Cohen, accusing the prosecution’s star witness of making up a phone conversation with Trump just before he sent $130,000 to Stormy Daniels’ attorney in October 2016.",
        "content": "CNN —\nDonald Trump attorney Todd Blanche raised his voice and flailed his arms at Michael Cohen, accusing the prosecution’s star witness of making up a phone conversation with Trump just before he sent $130,000 to Stormy Daniels’ attorney in October ... [9226 chars]",
        "url": "https://www.cnn.com/2024/05/16/politics/takeaways-trump-trial-michael-cohen-thursday/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/240516135735-01-sketch-trump-hush-money-trial-051624.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-16T23:54:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "13ffd0"
    },
    {
        "title": "Whoopi Goldberg Defends Harrison Butker's Controversial Graduation Speech",
        "description": "Whoopi Goldberg is weighing in on Kansas City Chiefs kicker Harrison Butker's recent controversial commencement speech at Benedictine College.",
        "content": "Whoopi Goldberg and other View panelists are weighing in on Kansas City Chiefs kicker Harrison Butker‘s recent controversial commencement speech at Benedictine College.\nThe NFL player was slammed on social media this week for his speech to graduating... [3488 chars]",
        "url": "https://www.hollywoodreporter.com/news/general-news/whoopi-goldberg-defends-harrison-butker-commencement-speech-1235901704/",
        "image": "https://www.hollywoodreporter.com/wp-content/uploads/2024/05/Whoopi-Goldberg-and-Harrison-Butker.jpg?w=1024",
        "publishedAt": "2024-05-16T23:40:45Z",
        "source": {
            "name": "Hollywood Reporter",
            "url": "https://www.hollywoodreporter.com"
        },
        "id": "1f2e43"
    },
    {
        "title": "Israel-Hamas war: Biden is sending $1 billion in new weapons package to Israel, aides say",
        "description": "It’s the first arms shipment to Israel to be announced by the administration since it put another arms transfer on hold earlier in the month.",
        "content": "WASHINGTON (AP) — The Biden administration has told key lawmakers it would send more than $1 billion in additional arms and ammunition to Israel, three congressional aides said Tuesday. But it was not immediately known how soon the weapons would be d... [4201 chars]",
        "url": "https://apnews.com/article/us-israel-arms-gaza-ebe971ca8878ff430ce6458c04151585",
        "image": "https://dims.apnews.com/dims4/default/4e4d0a6/2147483647/strip/true/crop/3522x1981+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F6b%2Ff10dd0c486d8f9026e537da65990%2F56762c2d15e44eb79b6ed41367fed105",
        "publishedAt": "2024-05-15T02:59:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "138258"
    },
    {
        "title": "Live Updates: The Westminster Dog Show Is Crowning the Nation’s Best Dog",
        "description": "Micha, a black cocker spaniel, and Monty, a giant schnauzer, were the first group winners of the night. The terriers are the last group to compete before this year’s best in show is awarded.",
        "content": "Pinned\nUpdated May 14, 2024, 9:34 p.m. ET May 14, 2024, 9:34 p.m. ET Benjamin Hoffman and\nThe dogs look magnificent, the handlers have treats in their pockets and the golden retriever never wins. There is a consistency to Westminster that makes it li... [1280 chars]",
        "url": "https://www.nytimes.com/live/2024/05/14/style/westminster-dog-show",
        "image": "https://static01.nyt.com/images/2024/05/14/multimedia/14westminster-live-promo-830p-gbqp/14westminster-live-promo-830p-gbqp-facebookJumbo.jpg",
        "publishedAt": "2024-05-15T01:45:00Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1816e0"
    },
    {
        "title": "Takeaways from the first day of Michael Cohen’s cross-examination in the Trump hush money trial",
        "description": "Donald Trump’s attorney Todd Blanche began his confrontation with Michael Cohen on Tuesday by throwing the former fixer’s language back in his face.",
        "content": "CNN —\nDonald Trump’s attorney Todd Blanche began his confrontation with Michael Cohen on Tuesday by throwing the former fixer’s language back in his face.\nBlanche confirmed the two had never spoken, but asked Cohen whether he knew who he was already,... [10606 chars]",
        "url": "https://www.cnn.com/2024/05/14/politics/takeaways-day-17-trump-hush-money-trial-michael-cohen/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-05-14t135552z-726301437-rc2cq7ag9frz-rtrmadp-3-usa-trump-new-york.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-15T01:29:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1fdffe"
    },
    {
        "title": "Man driving pickup in Marion bus crash charged with 8 counts of DUI manslaughter",
        "description": "Eight people died and 38 others were injured when a bus carrying farm workers collided with a pickup truck on State Road 40 in Marion County.",
        "content": "MARION COUNTY, Fla. — Eight people died and 38 others were injured when a bus carrying farm workers collided with a pickup truck on State Road 40 in Marion County. Read live updates below:\n10:10 p.m. update\nThe Mexican Consulate said the farmworkers ... [10065 chars]",
        "url": "https://www.wftv.com/news/local/troopers-investigate-deadly-crash-involving-large-capacity-vehicle-marion-county/WVWOVYKTBZFUHAMAVGIPB4ZIGM/",
        "image": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/Kc1GaCPmg68z5-8S-rLwnwGTwMU=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/TROAIUUDGFCZNJXRGSAW4SDEGU.jpg",
        "publishedAt": "2024-05-15T00:34:00Z",
        "source": {
            "name": "WFTV Orlando",
            "url": "https://www.wftv.com"
        },
        "id": "18db0b"
    },
    {
        "title": "Jim Justice wins West Virginia's GOP Senate primary and becomes favorite to flip Democratic seat",
        "description": "Republican Gov. Jim Justice has won West Virginia’s GOP Senate nomination. He is immediately favored to flip a Democratic seat that will be vacated by Sen. Joe Manchin.",
        "content": "ANNAPOLIS, Md. (AP) — Republican Gov. Jim Justice won West Virginia’s GOP Senate nomination on Tuesday as voters across two states with antithetical politics decided primary contests with big implications for the Senate majority fight this fall.\nIn a... [7203 chars]",
        "url": "https://apnews.com/article/maryland-west-virginia-senate-primary-republican-democrat-632750f07b79a9bd4922635fd07ca644",
        "image": "https://dims.apnews.com/dims4/default/4022896/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F04%2F4926b63ebe1f7dcbcd83fd34d45b%2F82e81112613745ed9ad2a841da11afad",
        "publishedAt": "2024-05-15T00:07:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1a8bc3"
    },
    {
        "title": "OpenAI co-founder Ilya Sutskever says he will leave the startup",
        "description": "OpenAI co-founder Ilya Sutskever said Tuesday that he's leaving the Microsoft-backed startup.",
        "content": "Sam Altman (L), US entrepreneur, investor, programmer, and founder and CEO of artificial intelligence company OpenAI, and the company's co-founder and chief scientist Ilya Sutskever, speak together at Tel Aviv University in Tel Aviv on June 5, 2023.\n... [3962 chars]",
        "url": "https://www.cnbc.com/2024/05/14/openai-co-founder-ilya-sutskever-says-he-will-leave-the-startup.html",
        "image": "https://image.cnbcfm.com/api/v1/image/107337930-1700665715409-gettyimages-1258459514-AFP_33GZ4VK.jpeg?v=1715728442&w=1920&h=1080",
        "publishedAt": "2024-05-14T23:13:54Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "id": "120365"
    },
    {
        "title": "Gayle King, 69, Stuns in Sports Illustrated Swimsuit Debut, Proving 'Sexy Isn't an Age'",
        "description": "The TV personality was shocked that she was chosen to grace the cover of the famed magazine, plus a few more surprises.",
        "content": "Entertainment gossip and news from Newsweek's network of contributors\nGayle King has celebrated a stunning milestone by gracing the cover of this year's Sports Illustrated Swimsuit 2024 issue, a reveal that surprised even her during a live segment on... [2666 chars]",
        "url": "https://www.newsweek.com/gayle-king-sports-illustrated-swim-cover-1900629",
        "image": "https://d.newsweek.com/en/full/2393122/gayle-king.jpg",
        "publishedAt": "2024-05-14T23:06:48Z",
        "source": {
            "name": "Newsweek",
            "url": "https://www.newsweek.com"
        },
        "id": "11751c"
    },
    {
        "title": "Cramer warns against 'meme stock mania,' says to sell GameStop and AMC",
        "description": "AMC and GameStop soared after \"Roaring Kitty,\" the man who helped bring on 2021's enormous short squeeze, posted online for the first time in about three years.",
        "content": "CNBC's Jim Cramer said investors should get out of stocks like GameStop and AMC , both of which saw huge rallies this week triggered by social media.\n\"When I see meme stock mania taking over again, led by GameStop and AMC, I need to remind you that t... [1309 chars]",
        "url": "https://www.cnbc.com/2024/05/14/cramer-warns-against-meme-stock-mania-says-to-sell-gamestop-and-amc.html",
        "image": "https://image.cnbcfm.com/api/v1/image/106850109-1614971556103-gettyimages-1231535869-AFP_94D4PJ.jpeg?v=1715712669&w=1920&h=1080",
        "publishedAt": "2024-05-14T23:00:25Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "id": "101fcf"
    },
    {
        "title": "Federal investigators release report into Baltimore bridge collapse",
        "description": "The preliminary report offers the first explanation of the problems that led to the Dali container ship’s destruction of the Francis Scott Key Bridge on March 26.",
        "content": "The ship that knocked down Baltimore’s Francis Scott Key Bridge suffered two electrical blackouts the day before the collision and experienced two more blackouts that disabled critical equipment, federal safety investigators said in a preliminary rep... [505 chars]",
        "url": "https://www.washingtonpost.com/dc-md-va/2024/05/14/baltimore-key-bridge-collapse-ntsb-report/",
        "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LQH6PNOZ26K3XBA36KNDWV2ZG4_size-normalized.jpg&w=1440",
        "publishedAt": "2024-05-14T22:43:00Z",
        "source": {
            "name": "The Washington Post",
            "url": "https://www.washingtonpost.com"
        },
        "id": "1eda0b"
    },
    {
        "title": "Sun shoots out biggest solar flare in nearly a decade",
        "description": "The sun isn't done yet. That's the message from the National Oceanic and Atmospheric Administration, as the biggest flare in nearly two decades erupted on the sun Tuesday.",
        "content": "CAPE CANAVERAL, Fla. (AP) — The sun produced its biggest flare in nearly two decades Tuesday, just days after severe solar storms pummeled Earth and created dazzling northern lights in unaccustomed places.\n“Not done yet!” the National Oceanic and Atm... [1626 chars]",
        "url": "https://apnews.com/article/sun-solar-flare-earth-ed204eef352560f09b8366bee05e2381",
        "image": "https://dims.apnews.com/dims4/default/7642ad2/2147483647/strip/true/crop/2048x1152+0+448/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F72%2Fd26428239eeef0d0bebec5a98467%2F308e03d8afd64265a1f332b46d525bbe",
        "publishedAt": "2024-05-14T22:41:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1119d7"
    },
    {
        "title": "Knicks embarrassed by Pacers in lethargic Game 4 loss to tie series",
        "description": "The Knicks were a disaster in the opening quarter, a lethargic, misfiring mess before rolling over in a Mother’s Day Massacre administered by the Pacers, xx-xx, who evened the NBA playoff series at 2-2.",
        "content": "INDIANAPOLIS — The Knicks absorbed a knockdown blow quickly and never got up.\nTom Thibodeau’s squad was a disaster in the opening quarter, a lethargic, misfiring mess before rolling over in a Mother’s Day Massacre administered by the Pacers, 121-89, ... [2597 chars]",
        "url": "https://nypost.com/2024/05/12/sports/knicks-embarrassed-by-pacers-in-lethargic-game-4-loss-to-tie-series/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/knicks-lose-game-4.jpg?quality=75&strip=all&1715535804&w=1024",
        "publishedAt": "2024-05-12T21:55:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "1431a8"
    },
    {
        "title": "Pro-Palestinian protests dwindle to tiny numbers and subtle defiant acts at US college graduations",
        "description": "Despite pro-Palestinian protests roiling some U.S. college campuses this spring, graduation ceremonies are going off largely peacefully so far.",
        "content": "A tiny contingent of Duke University graduates opposed pro-Israel comedian Jerry Seinfeld speaking at their commencement in North Carolina Sunday, with about 30 of the 7,000 students leaving their seats and chanting “free Palestine” amid a mix of boo... [4411 chars]",
        "url": "https://apnews.com/article/university-college-palestinian-protest-graduations-d05604ba10871f287ff6be4698b185c3",
        "image": "https://dims.apnews.com/dims4/default/fce2a2f/2147483647/strip/true/crop/3592x2021+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fc1%2F57d20978ed556b6da96af870bc5e%2Faaaa1a9cc64641bfbc5bcf5fad4f87ef",
        "publishedAt": "2024-05-12T21:33:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1a453b"
    },
    {
        "title": "As Seinfeld Receives Honorary Degree at Duke, Students Walk Out in Protest",
        "description": "Following the walkout, the comedian, who has been vocal about his support for Israel, opted to take a lighter approach in his commencement speech.",
        "content": "Jerry Seinfeld knows his way around handling awkward moments onstage. Even so, the initial reception he faced at Duke University’s commencement on Sunday reflected a more complicated audience than usual.\nAs Mr. Seinfeld, who has recently been vocal a... [561 chars]",
        "url": "https://www.nytimes.com/2024/05/12/us/jerry-seinfeld-duke-students-walk-out-protest.html",
        "image": "https://static01.nyt.com/images/2024/05/12/us/12campus-protest-duke2/12campus-protest-duke2-facebookJumbo.jpg",
        "publishedAt": "2024-05-12T21:03:16Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "12fb6e"
    },
    {
        "title": "Olivia Munn Shares She Underwent a Hysterectomy Amid Cancer Battle",
        "description": "Olivia Munn revealed in a new interview that in addition to her double mastectomy, she also had a hysterectomy after being diagnosed with breast cancer.",
        "content": "Watch : Olivia Munn Details “Terrifying” Breast Cancer Journey\nThis Mother's Day, Olivia Munn is sharing a heartbreaking but hopeful personal update amid her recovery from breast cancer.\nThe 43-year-old revealed that that in April, she made the decis... [902 chars]",
        "url": "https://www.eonline.com/news/1401437/olivia-munn-shares-she-underwent-a-hysterectomy-amid-cancer-battle",
        "image": "https://akns-images.eonline.com/eol_images/Entire_Site/2024213/rs_1200x1200-240313082522-olivia-munn-2.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
        "publishedAt": "2024-05-12T20:57:00Z",
        "source": {
            "name": "E! NEWS",
            "url": "https://www.eonline.com"
        },
        "id": "13f009"
    },
    {
        "title": "Putin appoints Sergei Shoigu as secretary of Russia’s national security council",
        "description": "Russia’s President Vladimir Putin began a Cabinet shakeup, proposing the replacement of Sergei Shoigu as defense minister as he begins his fifth term in office.",
        "content": "Russia’s President Vladimir Putin began a Cabinet shakeup on Sunday, proposing the replacement of Sergei Shoigu as defense minister as he begins his fifth term in office.\nIn line with Russian law, the entire Russian Cabinet resigned on Tuesday follow... [5655 chars]",
        "url": "https://apnews.com/article/russia-ukraine-war-kharkiv-e1f9250d200999ea3e87e9b96b4710d6",
        "image": "https://dims.apnews.com/dims4/default/25746ce/2147483647/strip/true/crop/4245x2388+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F28%2F6ea583ec5638143509b357c659ab%2Fdf97b7f93e2d434bbb2952ae698fda4d",
        "publishedAt": "2024-05-12T20:27:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "13fcfe"
    },
    {
        "title": "Christie’s says $850m auctions to go ahead as planned despite cyberattack",
        "description": "Sales to proceed despite failing to regain control of its website as staff and cybersecurity scramble to fix issue",
        "content": "The success of New York’s spring art auctions was in jeopardy Sunday, a day after auction house Christie’s confirmed that its website had been hacked, potentially shutting out some bidders on $850m worth of art work going up for bid this week.\nYet de... [3305 chars]",
        "url": "https://www.theguardian.com/us-news/article/2024/may/12/christies-cyberattack-new-york",
        "image": "https://i.guim.co.uk/img/media/73f7896a82453d965670a1401aec06f684c0b5a3/0_126_2738_1643/master/2738.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49df1e5a1a8f24752075a649fb12051f",
        "publishedAt": "2024-05-12T20:08:00Z",
        "source": {
            "name": "The Guardian US",
            "url": "https://www.theguardian.com"
        },
        "id": "1f0614"
    },
    {
        "title": "Former Chargers General Manager A.J. Smith dies at 75",
        "description": "Former Chargers General Manager A.J.",
        "content": "Former Chargers General Manager A.J. Smith has died at the age of 75.\nSmith’s son Kyle, who is the assistant G.M. of the Falcons, and the rest of his family announced the news on Sunday afternoon. Smith had battled prostate cancer for the last seven ... [647 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/former-chargers-general-manager-a-j-smith-dies-at-75",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/7c439f5/2147483647/strip/true/crop/3837x2158+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fbb%2Fb4%2Fa5114fdb48ef9e6ce56884368958%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F83216624",
        "publishedAt": "2024-05-12T20:04:54Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "id": "107be5"
    },
    {
        "title": "At Art Auctions Market Seeks Its Footing After Stumbling Sales and a Hack at Christie’s",
        "description": "Speculation drove art prices to new heights during the pandemic, but declining sales and a cyberattack ignited new worries.",
        "content": "Estimates are still soaring past the $20 million mark and canvases still bear the signatures of dependable ringers like Warhol, Basquiat and Picasso. But there is a shadow looming over the spring auction season that begins Monday.\nA cyberattack at Ch... [666 chars]",
        "url": "https://www.nytimes.com/2024/05/12/arts/design/will-auctions-revive-art-market.html",
        "image": "https://static01.nyt.com/images/2024/05/13/multimedia/12auction-preview-lhgf/12auction-preview-lhgf-facebookJumbo.jpg",
        "publishedAt": "2024-05-12T19:06:03Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "138c16"
    },
    {
        "title": "Ohio police officer killed in 'ambush,' suspect sought",
        "description": "Authorities say an Ohio police officer was shot and killed while answering a disturbance call over the weekend.",
        "content": "EUCLID, Ohio (AP) — An Ohio police officer was shot and killed after being “ambushed” while answering a disturbance call over the weekend, and a suspect was being sought, authorities said Sunday.\nPolice in the Cleveland suburb of Euclid said officers... [1793 chars]",
        "url": "https://apnews.com/article/euclid-ohio-officer-shot-074e9289eabf5c9c1c2be63c244ebf6d",
        "image": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png",
        "publishedAt": "2024-05-12T18:19:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "16c217"
    },
    {
        "title": "Jerry Seinfeld Sees Dozens Walk Out On His Duke Commencement Speech",
        "description": "The comedian has been an outspoken supporter of Israel, prompting Palestinian supporter to leave.",
        "content": "Duke University’s commencement ceremony on Sunday saw dozens walk out in protest of guest speaker Jerry Seinfeld, who has been a big supporter of Israel during the conflict in Gaza.\nA group of students left their seats when Seinfeld began, with at le... [997 chars]",
        "url": "https://deadline.com/2024/05/jerry-seinfeld-dozens-exit-his-duke-commencement-speech-1235913036/",
        "image": "https://deadline.com/wp-content/uploads/2024/04/Screenshot-2024-04-29-at-11.53.28 AM.png?w=1016",
        "publishedAt": "2024-05-12T18:18:00Z",
        "source": {
            "name": "Deadline",
            "url": "https://deadline.com"
        },
        "id": "1e9845"
    },
    {
        "title": "Caleb Williams’ precision, aura shine on Day 1 of Bears rookie minicamp",
        "description": "The Caleb Williams era began with a display of precision and accuracy that's to be expected from a \"generational\" prospect at rookie minicamp. From the aura to...",
        "content": "LAKE FOREST, Ill. -- The first day of the next era of Bears football arrived officially Friday when quarterback Caleb Williams and wide receiver Rome Odunze took the field at Halas Hall on Day 1 of rookie minicamp.\nWilliams and Odunze have already st... [4513 chars]",
        "url": "https://www.nbcsportschicago.com/nfl/chicago-bears/bears-analysis/bears-rookie-minicamp-observations-caleb-williams-precision-aura-shine-on-day-1/561390/",
        "image": "https://media.nbcsportschicago.com/2024/05/Caleb-Williams-minicamp-Getty.jpg?quality=85&strip=all&resize=1200%2C675",
        "publishedAt": "2024-05-11T00:13:15Z",
        "source": {
            "name": "NBC Sports Chicago",
            "url": "https://www.nbcsportschicago.com"
        },
        "id": "1c9946"
    },
    {
        "title": "Biden admin says it’s ‘reasonable to assess’ Israel used American weapons in Gaza in ways ‘inconsistent’ with international law",
        "description": "The Biden administration said Friday that it is “reasonable to assess” that US weapons have been used by Israeli forces in Gaza in ways that are “inconsistent” with international humanitarian law but stopped short of officially saying Israel violated the law.",
        "content": "CNN —\nThe Biden administration said Friday that it is “reasonable to assess” that US weapons have been used by Israeli forces in Gaza in ways that are “inconsistent” with international humanitarian law but stopped short of officially saying Israel vi... [3306 chars]",
        "url": "https://www.cnn.com/2024/05/10/politics/biden-israel-gaza-war-report/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2151654481.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-10T21:53:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1c47d4"
    },
    {
        "title": "In reversal, Virginia school board votes to restore Confederate names to 2 schools",
        "description": "A Virginia school board voted Friday to restore the names of Confederate military leaders to a high school and an elementary school, four years after the names had been removed.",
        "content": "A Virginia school board voted Friday to restore the names of Confederate military leaders to a high school and an elementary school, four years after the names had been removed.\nSchools Confederate Names FLE - A statue of confederate general Stonewal... [5971 chars]",
        "url": "https://wtop.com/virginia/2024/05/an-education-board-in-virginia-votes-to-restore-confederate-names-to-2-schools/",
        "image": "https://wtop.com/wp-content/uploads/2024/05/Schools_Confederate_Names_82737-scaled.jpg",
        "publishedAt": "2024-05-10T20:48:45Z",
        "source": {
            "name": "WTOP",
            "url": "https://wtop.com"
        },
        "id": "19088b"
    },
    {
        "title": "Day 15 of Trump New York hush money trial",
        "description": "Donald Trump's historic criminal hush money trial has wrapped up for the day. His former attorney Michael Cohen is expected to begin his testimony on Monday.",
        "content": "Prosecutors say it’s entirely possible they could rest their case by the end of next week. Here are the takeaways from day 15 of the Trump hush money trial:\nCohen is on deck: Donald Trump's former attorney Michael Cohen is expected to take the stand ... [2932 chars]",
        "url": "https://www.cnn.com/politics/live-news/trump-hush-money-trial-05-10-24/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/240507094220-01-donald-trump-hush-money-trial-050724-super-tease.jpg",
        "publishedAt": "2024-05-10T20:30:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "11e4bc"
    },
    {
        "title": "Biden Administration to Pay Dairy Farmers for Bird Flu Protective Measures",
        "description": "The payment system amounted to one of the most forceful actions taken so far by agriculture officials who have raced to keep up with the spread of the virus among dairy cows.",
        "content": "The Biden administration said on Friday that it would compensate dairy farmers for cooperating with its efforts to limit the spread of the bird flu virus, part of a series of expansive measures aimed at containing an outbreak.\nThe payment system amou... [726 chars]",
        "url": "https://www.nytimes.com/2024/05/10/us/politics/dairy-farms-bird-flu-protection.html",
        "image": "https://static01.nyt.com/images/2024/05/10/multimedia/10dc-birdflu-qhjm/10dc-birdflu-qhjm-facebookJumbo.jpg",
        "publishedAt": "2024-05-10T20:14:47Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "10915f"
    },
    {
        "title": "College campus protests: Encampments cleared from at least 3 universities as pro-Palestinian demonstrations continue",
        "description": "Pro-Palestinian encampments were cleared from at least three college campuses early Friday, marking some of the latest examples of schools using law enforcement to respond to demonstrations that have popped up across the country in recent weeks. Here are the latest developments:",
        "content": "CNN —\nPro-Palestinian encampments were cleared from at least three college campuses early Friday as schools across the country continued to call in law enforcement to quell demonstrations in recent weeks. Here are the latest developments:\nPolice brok... [9906 chars]",
        "url": "https://www.cnn.com/2024/05/10/us/college-campus-protests-encampments-cleared/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap24131351488475.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-10T20:03:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "10daed"
    },
    {
        "title": "Protesters attempt to storm Tesla’s factory in Germany",
        "description": "As many as 800 activists gathered outside Tesla’s factory near Berlin Friday to protest its expansion plans, and some of them clashed with police as they attempted to break into the plant.",
        "content": "London CNN —\nAs many as 800 activists gathered outside Tesla’s factory near Berlin Friday to protest its expansion plans, and some of them clashed with police as they attempted to break into the plant.\n“There are currently 800 activists on the Tesla ... [2984 chars]",
        "url": "https://www.cnn.com/2024/05/10/business/tesla-protests-berlin-factory-police/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2151732353.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-10T19:40:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1016c4"
    },
    {
        "title": "California governor would slash 10,000 vacant state jobs to help close $27.6 billion deficit",
        "description": "California Gov. Gavin Newsom says the state’s budget deficit is $27.6 billion. The figure Newsom announced Friday is smaller than the deficit he anticipated in January.",
        "content": "SACRAMENTO, Calif. (AP) — California has a budget deficit of $27.6 billion, Gov. Gavin Newsom announced Friday — a gap so wide that he’s proposing eliminating 10,000 vacant state jobs and cutting spending across 260 state programs.\nThe Democratic gov... [5373 chars]",
        "url": "https://apnews.com/article/california-budget-deficit-gov-gavin-newsom-8f502d57d00d551c0b6b6331367f7a25",
        "image": "https://dims.apnews.com/dims4/default/486a772/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2F54%2Fdd916b97fced245c102fe0aa88de%2F483a595f848c471184189d401780db18",
        "publishedAt": "2024-05-10T19:39:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1deea4"
    },
    {
        "title": "KTLA Entertainment Reporter Was 64",
        "description": "Sam Rubin, a popular entertainment reporter on KTLA since 1991, died Friday, a source close to the station confirmed. He was 64.",
        "content": "Sam Rubin, a popular entertainment reporter on KTLA since 1991, died Friday. He was 64.\nA source close to the station confirmed that Rubin died at his home of a heart attack after doing his regular Hollywood news segments on KTLA’s 7-9 a.m. “Morning ... [1773 chars]",
        "url": "https://variety.com/2024/tv/news/sam-rubin-dead-ktla-entertainment-reporter-1235998979/",
        "image": "https://variety.com/wp-content/uploads/2024/05/GettyImages-508507042-e1715368923971.jpg?w=1000&h=563&crop=1",
        "publishedAt": "2024-05-10T19:36:00Z",
        "source": {
            "name": "Variety",
            "url": "https://variety.com"
        },
        "id": "12c6bc"
    },
    {
        "title": "A solar storm could produce northern lights in US",
        "description": "An unusually strong solar storm hitting Earth could produce northern lights in the U.S. and potentially disrupt power and communications this weekend.",
        "content": "CAPE CANAVERAL, Fla. (AP) — An unusually strong solar storm hitting Earth could produce northern lights in the U.S. this weekend and potentially disrupt power and communications.\nThe National Oceanic and Atmospheric Administration issued a rare sever... [3521 chars]",
        "url": "https://apnews.com/article/solar-storm-flares-eruption-sun-fc23251025efc2d20dc128dc0b6a7c68",
        "image": "https://dims.apnews.com/dims4/default/5f2e884/2147483647/strip/true/crop/1024x576+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Ff7%2F922e9dc7c307254c367204c8120b%2F647cbdd5085c45dba38e8682cd5bc97b",
        "publishedAt": "2024-05-10T19:14:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "146693"
    },
    {
        "title": "Cows have human flu receptors, study shows, raising the stakes on the bird flu outbreak in dairy cattle",
        "description": "Cows have the same kinds of gateways into their cells as humans and birds, a new study shows. The finding suggests that cows could be mixing bowls - hosts that could help H5N1 bird flu learn to spread in humans.",
        "content": "CNN —\nIn early March, Dr. Barb Petersen, a large-animal vet in Texas, began getting calls from the dairy farms she works with in the Panhandle. Workers there were seeing a lot of cows with mastitis, an infection of the udder.\nTheir milk was thickened... [9456 chars]",
        "url": "https://www.cnn.com/2024/05/09/health/bird-flu-cows-human-receptors/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2139565276.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-09T23:56:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1e3059"
    },
    {
        "title": "Satellite imagery shows Palestinians fleeing Rafah’s tent cities as threat of major attack looms",
        "description": "Palestinians have begun to flee Rafah’s tent cities in large numbers over the past 72 hours, as the threat of a potential major Israeli assault looms, new satellite imagery from Planet Labs shows.",
        "content": "CNN —\nPalestinians have begun to flee Rafah’s tent cities in large numbers over the past 72 hours, as the threat of a potential major Israeli assault looms, new satellite imagery from Planet Labs shows.\nCNN has identified several camps sheltering Gaz... [2847 chars]",
        "url": "https://www.cnn.com/2024/05/09/middleeast/rafah-palestinians-refugees-fleeing-intl-latam/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/8-camp-3-may-7.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-09T23:55:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1e5828"
    },
    {
        "title": "Judge Merchan chides Trump’s lawyers for not objecting more during Stormy Daniels’ testimony",
        "description": "Judge Juan Merchan called out former President Donald Trump’s defense team during their motion for a mistrial Thursday afternoon, telling them there were many times they could have objected to Stormy Daniels’ testimony, but did not.",
        "content": "CNN —\nJudge Juan Merchan called out former President Donald Trump’s defense team during their motion for a mistrial Thursday afternoon, telling them there were many times they could have objected to Stormy Daniels’ testimony, but did not.\nFor the sec... [2029 chars]",
        "url": "https://www.cnn.com/2024/05/09/politics/judge-merchan-calls-out-trump-attorneys-mistrial/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/20240509-112747-resized.JPG?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-09T23:53:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "130d60"
    },
    {
        "title": "Target to pull LGBTQ-themed items from some stores during Pride Month: report",
        "description": "Target is planning to cut LGBTQ-themed merchandise from some of its stores during Pride Month this June, Bloomberg News reported Thursday, after a backlash hit sales of the retailer last year.",
        "content": "Target is planning to cut LGBTQ-themed merchandise from some of its stores during Pride Month this June, Bloomberg News reported Thursday, after a backlash hit sales of the retailer last year.\nTarget plans to offer the full assortment of the merchand... [555 chars]",
        "url": "https://nypost.com/2024/05/09/business/target-to-pull-lgbtq-themed-items-from-some-stores-during-pride-month-report/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/target-pride-month.jpg?quality=75&strip=all&1715278930&w=1024",
        "publishedAt": "2024-05-09T23:11:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "147ce8"
    },
    {
        "title": "Florida sheriff releases bodycam video of airman fatally shot in apartment, disputes family’s claim deputy went to wrong unit",
        "description": "A Florida sheriff’s office publicly released bodycam footage from a deputy who fatally shot a Black airman in his home last week, and disputed claims from the victim’s family that the deputy had gone to the wrong apartment.",
        "content": "CNN —\nA Florida sheriff publicly released bodycam footage from a deputy who fatally shot a Black airman in his home last week – and disputed claims from the victim’s family that the deputy had gone to the wrong apartment.\nOkaloosa County Sheriff Eric... [7663 chars]",
        "url": "https://www.cnn.com/2024/05/09/us/roger-forston-florida-airman-shot/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/441454141-869248471895834-1411584953247858968-n.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-09T22:56:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1e699e"
    },
    {
        "title": "Trump is limited in what he can say about his court case. His GOP allies are showing up to help",
        "description": "Former President Donald Trump is limited in what he can publicly say as his hush money trial is underway in New York.",
        "content": "Former President Donald Trump is limited in what he can publicly say as he fights charges that he made payments to a porn actor to illegally influence the 2016 election. But he’s getting help from some GOP allies who are glad to show up and talk.\nU.S... [3991 chars]",
        "url": "https://apnews.com/article/trump-daniels-trial-rick-scott-3ae0d6eddb94d2ca1155b0266dc9d35c",
        "image": "https://dims.apnews.com/dims4/default/d6dc806/2147483647/strip/true/crop/3213x1807+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F91%2F3c48cd3a52645ff60d11538f570a%2Fc3da26d5b07243d08175ead0d915046e",
        "publishedAt": "2024-05-09T22:36:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "14db15"
    },
    {
        "title": "Florida Airman Was Shot by Deputy Within Seconds of Opening Apartment Door, Body Cam Footage Shows",
        "description": "Only as Fortson is lying on the floor of his apartment fatally wounded does the deputy tell him to drop his weapon, a firearm that was legally owned, according to an attorney for the airman's family.",
        "content": "A Florida deputy fired the six rounds that killed Senior Airman Roger Fortson within seconds of the airman opening the door, police body camera footage released Thursday reveals.\nThe footage shows the unidentified deputy firing into Fortson's chest a... [8124 chars]",
        "url": "https://www.military.com/daily-news/2024/05/09/body-cam-footage-deputy-fatally-shot-florida-airman-within-seconds-of-him-opening-apartment-door.html",
        "image": "https://images03.military.com/sites/default/files/styles/full/public/2024-05/ApNewsroom_Police_Shooting_Airman_21657.jpg",
        "publishedAt": "2024-05-09T22:14:00Z",
        "source": {
            "name": "Military.com",
            "url": "https://www.military.com"
        },
        "id": "18f10a"
    },
    {
        "title": "'Caramelo,' the Brazilian horse stranded on a roof by floods, is rescued after stirring the nation",
        "description": "About 24 hours after it was first spotted and with people clamoring for the rescue of a horse social media users nicknamed Caramelo, a team in Brazil’s Rio Grande do Sul state have successfully removed Caramelo, providing a dose of hope to a beleaguered region.",
        "content": "A man and his dog reunite at a shelter providing refuge for dogs evacuated from areas flooded by heavy rains, in Canoas, Rio Grande do Sul state, Brazil, Thursday, May 9, 2024. (AP Photo/Andre Penner)\nCANOAS, Brazil (AP) — A Brazilian horse nicknamed... [5171 chars]",
        "url": "https://apnews.com/article/brazil-floods-rio-grande-do-sul-horse-rescue-d50d1c2436245c24a0094d4106b60e85",
        "image": "https://dims.apnews.com/dims4/default/c2fa0aa/2147483647/strip/true/crop/3803x2139+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F56%2Ff7ff70538c3f0754214a42377d70%2Fd6ffc18eed0e44148fd1be3364cd4424",
        "publishedAt": "2024-05-09T22:08:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "17d8e9"
    },
    {
        "title": "Brazil floods: horse stranded on roof is rescued as death toll rises to 107 people",
        "description": "Animal dubbed ‘Caramelo’ was trapped for days, balancing on two strips of slippery asbestos after flooding hit the Porto Alegre area",
        "content": "Emergency workers have rescued a horse that had been trapped for days on a rooftop after severe floods in southern Brazil, as the death toll from the disaster rose to 107 people.\nThe animal, dubbed Caramelo on social media, had been balancing on two ... [2339 chars]",
        "url": "https://www.theguardian.com/world/article/2024/may/09/brazil-floods-horse-stranded-rescued",
        "image": "https://i.guim.co.uk/img/media/1f3e9ecfce1d67961c8953716629dc53ed8de2e5/0_0_2200_1320/master/2200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cc6f431bed91162b571f26d136e0f950",
        "publishedAt": "2024-05-09T21:31:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "id": "18fab8"
    },
    {
        "title": "Cornell University President Martha Pollack steps down after year of turmoil, threats to Jewish students",
        "description": "Cornell University President Martha Pollack is ending her 7-year tenure as the head of the Ivy League school following months of turmoil including demonstrations and threats to Jewish students.",
        "content": "Cornell University President Martha Pollack is ending her 7-year tenure as the head of the Ivy League school in upstate Ithaca — following months of turmoil including demonstrations and threats to Jewish students.\nThe 65-year-old insisted that her de... [3492 chars]",
        "url": "https://nypost.com/2024/05/09/us-news/cornell-university-president-martha-pollack-steps-down-after-year-of-turmoil-threats-to-jewish-students/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/81548748.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2024-05-09T21:27:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "10a657"
    },
    {
        "title": "Biden says he will stop sending bombs and artillery shells to Israel if it launches major invasion of Rafah",
        "description": "President Joe Biden said for the first time Wednesday he would halt shipments of American weapons to Israel – which he acknowledged have been used to kill civilians in Gaza – if Prime Minister Benjamin Netanyahu orders a major invasion of the city of Rafah.",
        "content": "Racine, Wisconsin CNN —\nPresident Joe Biden said for the first time Wednesday he would halt some shipments of American weapons to Israel – which he acknowledged have been used to kill civilians in Gaza – if Prime Minister Benjamin Netanyahu orders a ... [9637 chars]",
        "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/240508152421-biden-ebof-preview-sot-digvid.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-09T00:32:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "15ed8f"
    },
    {
        "title": "Nikola Jokic wins NBA MVP award for the third time",
        "description": "Nikola Jokic beat out fellow finalists Shai Gilgeous-Alexander and Luka Doncic to become the ninth player in NBA history to win at least three MVP awards.",
        "content": "Denver Nuggets center Nikola Jokic was named the NBA’s Most Valuable Player on Wednesday, becoming the ninth player in league history and the first international player to win the award at least three times.\nThe Serbian star beat out Oklahoma City Th... [372 chars]",
        "url": "https://www.washingtonpost.com/sports/2024/05/08/nikola-jokic-nba-mvp/",
        "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WZKCG5BCZJCYZBKLEDNQHWLPMY.jpg&w=1440",
        "publishedAt": "2024-05-08T23:55:08Z",
        "source": {
            "name": "The Washington Post",
            "url": "https://www.washingtonpost.com"
        },
        "id": "10cfc8"
    },
    {
        "title": "Florida deputies who fatally shot US airman burst into wrong apartment, attorney says",
        "description": "A civil rights attorney says deputies responding to a disturbance call at a Florida apartment complex burst into the wrong unit and fatally shot a Black U.S.",
        "content": "MIAMI (AP) — Deputies responding to a disturbance call at a Florida apartment complex burst into the wrong unit and fatally shot a Black U.S. Air Force airman who was home alone when they saw he was armed with a gun, an attorney for the man’s family ... [5006 chars]",
        "url": "https://apnews.com/article/police-shooting-airman-florida-8bcc82463ada69264389edf2a4f1a83d",
        "image": "https://dims.apnews.com/dims4/default/7883d96/2147483647/strip/true/crop/3744x2106+0+642/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fbc%2F9614ef22553716c15e013d01d696%2F56244d8b6a5b4e4d8b1d36c4ebb5d855",
        "publishedAt": "2024-05-08T23:51:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1b7a3d"
    },
    {
        "title": "Ultraprocessed foods linked with early death, according to 30 years of research",
        "description": "Studies have shown that ultraprocessed foods can have a detrimental impact on health. But 30 years of research show they don’t all have the same impact.",
        "content": "Sign up for CNN’s Eat, But Better: Mediterranean Style. Our eight-part guide shows you a delicious expert-backed eating lifestyle that will boost your health for life.\nCNN —\nEating ultraprocessed foods is associated with an early risk of death, accor... [4191 chars]",
        "url": "https://www.cnn.com/2024/05/08/health/ultraprocessed-foods-death-study-wellness/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-689101168.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-08T22:30:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1e5eaa"
    },
    {
        "title": "House Republicans Attacked. New York’s Chancellor Defended His Schools.",
        "description": "Under rapid-fire questioning, David C. Banks, the chancellor of New York City schools, pushed back on accusations that the district had allowed antisemitism to fester.",
        "content": "At a two-hour House hearing on antisemitism in public schools on Wednesday, the New York City schools chief, David C. Banks, made one thing very clear: He was ready to fight.\nMr. Banks, a native New Yorker who leads the nation’s largest school distri... [808 chars]",
        "url": "https://www.nytimes.com/2024/05/08/nyregion/david-banks-antisemitism-hearing.html",
        "image": "https://static01.nyt.com/images/2024/05/08/multimedia/08k12-antisemitism-banks-confidence-cwkb/08k12-antisemitism-banks-confidence-cwkb-facebookJumbo.jpg",
        "publishedAt": "2024-05-08T22:25:20Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "14c59b"
    },
    {
        "title": "Olivia Dunne hypes up Pirates boyfriend Paul Skenes for MLB call-up",
        "description": "Olivia Dunne is excited for her boyfriend, Pirates pitcher Paul Skenes, to join The Show. The Pirates announced earlier Wednesday that Skenes will join their MLB roster and make his MLB debut against the Cubs on Saturday.",
        "content": "Olivia Dunne is excited for her boyfriend, Pirates pitcher Paul Skenes, to join The Show.\nThe Pirates announced Wednesday that Skenes will join their MLB roster and make his big league debut against the Cubs on Saturday.\nDunne reacted to the news on ... [2028 chars]",
        "url": "https://nypost.com/2024/05/08/sports/olivia-dunne-hypes-up-pirates-boyfriend-paul-skenes-for-mlb-call-up/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/newspress-collage-1m32d5yc4-1715205079890.jpg?quality=75&strip=all&1715190738&w=1024",
        "publishedAt": "2024-05-08T22:23:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "1c7e26"
    },
    {
        "title": "Southern Brazil still reeling from flooding as it faces risk from new storms",
        "description": "Authorities in southern Brazil are rushing to rescue survivors of massive flooding that has killed at least 100 people, but some residents are refusing to leave belongings behind while others are returning to evacuated homes despite the risk of new storms.",
        "content": "PORTO ALEGRE, Brazil (AP) — As major floods engulfed entire cities in the northern part of the Brazil’s Rio Grande do Sul state last week, meteorologist Estael Sias knew the water would drain into capital Porto Alegre’s metropolitan region and that s... [6718 chars]",
        "url": "https://apnews.com/article/brazil-porto-alegre-floods-rio-grande-do-sul-6daa5788e5cf6ec9a94cb3ea30fa6b18",
        "image": "https://dims.apnews.com/dims4/default/1f02a00/2147483647/strip/true/crop/3855x2168+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F11%2Fb1ecf2bbe1096a1d4259a7d7721d%2Ffe640b8da1454137bf060f9fe5d4d92c",
        "publishedAt": "2024-05-08T22:11:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "176be1"
    },
    {
        "title": "Rafah: Israeli military operations expand from airstrikes to ground operations, satellite images show",
        "description": "Images obtained by CNN from Planet Labs bear a striking resemblance to the early stages of Israel’s ground invasion of Gaza in October 2023.",
        "content": "CNN —\nIsrael’s attack in the southern Gaza city of Rafah has expanded from airstrikes to ground operations, new satellite images obtained by CNN from Planet Labs show.\nThe images, which bear a striking resemblance to the early stages of Israel’s grou... [4749 chars]",
        "url": "https://www.cnn.com/2024/05/08/middleeast/rafah-israel-idf-ground-operation-intl-latam/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/8-damage-5-after-may-7.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-08T22:08:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "176c72"
    },
    {
        "title": "In effort to prevent rabies, CDC launches new rules for bringing dogs into the US",
        "description": "The United States has new rules for how dogs are brought into the country, and they go into effect in August.",
        "content": "CNN —\nThe United States has new rules for how dogs are brought into the country, and they go into effect in August.\nThe US Centers for Disease Control and Prevention announced Wednesday that it is updating regulations for bringing dogs into the Unite... [4087 chars]",
        "url": "https://www.cnn.com/2024/05/08/health/cdc-dog-import-rules/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap24129549733853.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-08T21:52:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1e6f00"
    },
    {
        "title": "Archegos founder Bill Hwang heads to trial over collapse of $36bn fund",
        "description": "Sung Kook ‘Bill’ Hwang charged with racketeering conspiracy, fraud and market manipulation for alleged stock scheme in 2021",
        "content": "Sung Kook “Bill” Hwang arrived in court on Wednesday for the start of his criminal racketeering trial over the collapse of Archegos Capital Management, facing charges that he and a deputy broke the law in a stock scheme that unraveled in just days in... [3285 chars]",
        "url": "https://www.theguardian.com/business/article/2024/may/08/bill-hwang-hedge-fund-trial-archegos",
        "image": "https://i.guim.co.uk/img/media/e51e1de269a6563d13478acfadcf3ff3afab5a47/40_0_1740_1044/master/1740.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=32ea84378396bb554ada8d96d20276f4",
        "publishedAt": "2024-05-08T21:11:00Z",
        "source": {
            "name": "The Guardian",
            "url": "https://www.theguardian.com"
        },
        "id": "178c94"
    },
    {
        "title": "Inquiry Finds a Toxic Culture at the F.D.I.C., and Takes Aim at Its Leader",
        "description": "Bad workplace behavior was pervasive at the bank regulator, according to an investigation that questioned whether things can improve without a change in leadership.",
        "content": "A report on workplace culture at the Federal Deposit Insurance Corporation released on Tuesday revealed a broad, yearslong pattern of sexual harassment, discrimination and abuse of mostly women and members of minority groups by senior officials. The ... [1196 chars]",
        "url": "https://www.nytimes.com/2024/05/07/business/fdic-inquiry-workplace-culture.html",
        "image": "https://static01.nyt.com/images/2024/05/07/multimedia/07FDIC-REPORT-01-vlqj/07FDIC-REPORT-01-vlqj-facebookJumbo.jpg",
        "publishedAt": "2024-05-07T22:12:05Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1980cc"
    },
    {
        "title": "UCLA police reviewing footage of attack on protesters' encampment; Gascón, FBI contacted for help",
        "description": "An investigation continued into the attack on pro-Palestinian protesters' encampment last week at Royce Quad at UCLA.",
        "content": "UCLA's chancellor vowed that \"instigators\" who attacked the encampment \"will be prosecuted to the fullest extent of the law.\"\nAn investigation continued into the attack on pro-Palestinian protesters' encampment last week at UCLA, which the college's ... [5949 chars]",
        "url": "https://abc7.com/ucla-police-reviewing-footage-of-attack-on-protesters-encampment-gascn-fbi-contacted-for-help/14779007/",
        "image": "https://cdn.abcotvs.com/dip/images/14778382_050724-kabc-4am-ucla-protests-vid.jpg?w=1600",
        "publishedAt": "2024-05-07T21:22:30Z",
        "source": {
            "name": "KABC-TV",
            "url": "https://abc7.com"
        },
        "id": "15af50"
    },
    {
        "title": "Trump classified documents trial in Florida postponed indefinitely",
        "description": "The trial on charges that Donald Trump willfully retained classified national security records after leaving the White House was scheduled to start May 20.",
        "content": "Republican presidential candidate and former U.S. President Donald Trump gestures while he walks with his attorney Todd Blanche, as his criminal trial over charges that he falsified business records to conceal money paid to silence porn star Stormy D... [2408 chars]",
        "url": "https://www.cnbc.com/2024/05/07/trump-classified-documents-trial-postponed-indefinitely.html",
        "image": "https://image.cnbcfm.com/api/v1/image/107411073-17150196442024-05-06t181957z_1556899629_rc26l7a179co_rtrmadp_0_usa-trump-new-york.jpeg?v=1715019664&w=1920&h=1080",
        "publishedAt": "2024-05-07T21:02:03Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "id": "12bb84"
    },
    {
        "title": "Google offering boosted Pixel 8a trade-in values for older phones",
        "description": "Google is offering some excellent Pixel 8a trade-in values, with especially good prices for older A-Series Pixel phones.",
        "content": "Google just launched the Pixel 8a and, through the Google Store, it’s offering the device for free with select trade-ins. If you’re upgrading from a previous Pixel A-Series device, too, Google has some pretty decent trade-in deals to offer with Pixel... [2139 chars]",
        "url": "https://9to5google.com/2024/05/07/google-pixel-8a-trade-in-values/",
        "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2024/05/Google-Pixel-8a-v5.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "publishedAt": "2024-05-07T21:00:00Z",
        "source": {
            "name": "9to5Google",
            "url": "https://9to5google.com"
        },
        "id": "1abd6c"
    },
    {
        "title": "Tornadoes keep tearing through US, striking Barnsdall, Oklahoma twice in weeks",
        "description": "Powerful storms have erupted in the central United States, bringing tornadoes to rural northeast Oklahoma and large hail in parts of Kansas.",
        "content": "OKLAHOMA CITY (AP) — A tornado destroyed homes, forced the evacuation of a nursing home and toppled trees and power lines when it roared through a small Oklahoma town, one of several twisters that erupted in the central United States amid a series of... [6424 chars]",
        "url": "https://apnews.com/article/tornadoes-storms-weather-oklahoma-kansas-b8def43f7b0402d12911573ea5b4233b",
        "image": "https://dims.apnews.com/dims4/default/e866bc2/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F9c%2F3f1ee4414e72daafa0d77e43f289%2F7580896083c44442926ab884806e12ad",
        "publishedAt": "2024-05-07T20:56:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1b0501"
    },
    {
        "title": "Biden Condemns a ‘Ferocious Surge’ of Antisemitism in the United States",
        "description": "President Biden’s speech at a Holocaust remembrance ceremony came during weeks of protests on U.S. college campuses against Israel’s war in Gaza.",
        "content": "President Biden on Tuesday condemned a “ferocious surge of antisemitism” in the United States following the Oct. 7 Hamas attack against Israel and said people were already forgetting the deadliest day for Jews since the Holocaust.\nSpeaking at the U.S... [509 chars]",
        "url": "https://www.nytimes.com/2024/05/07/us/politics/biden-antisemitism-holocaust-speech.html",
        "image": "https://static01.nyt.com/images/2024/05/07/multimedia/07dc-biden-whkp/07dc-biden-whkp-facebookJumbo.jpg",
        "publishedAt": "2024-05-07T20:18:08Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "178d53"
    },
    {
        "title": "Here's what Apple announced at its iPad-focused ‘Let loose’ event",
        "description": "Here is a summary of everything Apple announced at its iPad-focused 'Let loose' event on May 7, including the M4 iPad Pro and iPad Air 6.",
        "content": "Today Apple held its ‘Let loose’ event, where over the span of 38 minutes the company debuted its latest and most advanced iPad hardware yet. There were some software surprises sprinkled in too.\nIn the market for a new iPad? Just curious to see what ... [3699 chars]",
        "url": "https://9to5mac.com/2024/05/07/everything-announced-at-let-loose-event/",
        "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/05/timcook-appleevnet.webp?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "publishedAt": "2024-05-07T20:17:00Z",
        "source": {
            "name": "9to5Mac",
            "url": "https://9to5mac.com"
        },
        "id": "163852"
    },
    {
        "title": "2 more GM candidates turn down Patriots’ interview requests",
        "description": "New England is unsuccessfully looking for a head of football operations.",
        "content": "The New England Patriots’ search for a new head football executive remains stuck in the mud. On Tuesday, two more potential candidates have declined a chance to interview with the organization.\nNeither former Arizona Cardinals vice president of playe... [1592 chars]",
        "url": "https://www.patspulpit.com/2024/5/7/24151344/patriots-general-manager-candidates-turn-down-interview-requests",
        "image": "https://cdn.vox-cdn.com/thumbor/u1IyMOsx7a0xp0zz6mZVS5YOGl4=/0x376:935x866/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25437678/quentinharris.jpg",
        "publishedAt": "2024-05-07T19:33:18Z",
        "source": {
            "name": "Pats Pulpit",
            "url": "https://www.patspulpit.com"
        },
        "id": "17f507"
    },
    {
        "title": "US soldier arrested in Russia told local girlfriend he supported Trump, repeated Kremlin line on 'aggressive' NATO, videos show",
        "description": "\"I think NATO is pretty aggressive,\" Army Staff Sgt. Gordon C. Black, 34, told an online audience in a video featuring his then-girlfriend Aleksa Viktorovna. \"Honestly, I understand Russia's position. Obviously, they want to defend their country.\"",
        "content": "WASHINGTON – An American soldier jailed in Russia last week empathized with Russia’s view of the war in Ukraine and repeated Moscow’s talking points decrying NATO in videos posted to his Russian ex-girlfriend’s TikTok account.\n“I think NATO is pretty... [5410 chars]",
        "url": "https://nypost.com/2024/05/07/world-news/us-soldier-arrested-in-russia-told-local-girlfriend-he-supported-trump-repeated-kremlin-line-on-aggressive-nato-videos-show/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/us-soldier-russia-detained-comp.jpg?quality=75&strip=all&w=1024",
        "publishedAt": "2024-05-07T19:11:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "148356"
    },
    {
        "title": "Largest study of its kind to investigate why Black women are more likely to die from most types of cancer",
        "description": "The American Cancer Society said Tuesday that it is seeking participants for what may be the largest national study of its kind, one that aims to solve the mystery of why Black women have the lowest survival rate of any racial or ethnic group in the US for most cancers.",
        "content": "CNN —\nThe American Cancer Society said Tuesday that it is seeking participants for what may be the largest national study of its kind, one that aims to solve the mystery of why Black women have the lowest survival rate of any racial or ethnic group i... [3015 chars]",
        "url": "https://www.cnn.com/2024/05/07/health/black-women-cancer-rates-study/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2120556951.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-07T19:05:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1a1c70"
    },
    {
        "title": "Netanyahu: 'Hamas Is Adamant in Its Position - We Can't Accept Demands That Mean Our Surrender'",
        "description": "Israel Says It Will Send Team to Cairo Only After Hamas Officially Agrees to Truce Proposal CIA Director in Cairo for Meetings on Gaza Conflict, Egyptian Sources Say Hamas Requests Guarantees From Turkey and Russia for Cease-fire Deal, Hamas Official Says Senior Palestinian Islamic Jihad Member Who Took Part in the Oct. 7 Attack Killed",
        "content": "The National Unity party said the party's ministers, Benny Gantz, Gadi Eisenkot and Chili Trooper, support closing the Qatari news channel Al Jazeera in Israel but that the timing of Sunday's vote was not ideal, \"could sabotage efforts to conclude th... [268 chars]",
        "url": "https://www.haaretz.com/israel-news/2024-05-05/ty-article-live/netanyahu-israel-will-not-agree-to-end-the-war-as-part-of-gaza-deal-with-hamas/0000018f-468d-d17f-adcf-ffef8ee60000",
        "image": "https://img.haarets.co.il/bs/0000018f-4829-d414-a5bf-fb3fc7370000/3c/6e/f9d4f0634a839486b2a55e9ffb48/44757.jpg?precrop=2200,1279,x0,y74&height=630&width=1200",
        "publishedAt": "2024-05-05T10:43:00Z",
        "source": {
            "name": "Haaretz",
            "url": "https://www.haaretz.com"
        },
        "id": "14d16b"
    },
    {
        "title": "Frank Stella Went From Bauhaus to Fun House",
        "description": "He was consumed with abstract painting and determined to keep it alive even when it became an unpopular cause among younger artists.",
        "content": "Frank Stella, who died on Saturday at age 87, once joked that he harbored only one regret. We were sitting in his scruffy studio in the East Village, and he said he was sorry that he had failed to take legal action when the men's wear store bearing h... [1002 chars]",
        "url": "https://www.nytimes.com/2024/05/05/arts/design/frank-stella-abstract-artist-appraisal.html",
        "image": "https://static01.nyt.com/images/2021/06/24/arts/00frankstella-appraisal1/00frankstella-appraisal1-facebookJumbo.jpg",
        "publishedAt": "2024-05-05T09:00:29Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1abdd5"
    },
    {
        "title": "UFC 301 post-fight show: Reaction to Alexandre Pantoja’s scare, Jose Aldo’s big return",
        "description": "MMA Fighting reacts to UFC 301, including the night-ending hometown wins for Alexandre Pantoja and Jose Aldo.",
        "content": "The Brazilian fans in Rio de Janeiro certainly went home happy after Alexandre Pantoja earned a hard-fought unanimous decision win over Steve Erceg to retain his flyweight title in the UFC 301 main event, but it was Jose Aldo, now the sport’s biggest... [722 chars]",
        "url": "https://www.mmafighting.com/2024/5/5/24149348/ufc-301-post-fight-show-reaction-to-alexandre-pantojas-scare-jose-aldos-big-return",
        "image": "https://cdn.vox-cdn.com/thumbor/eCqGUxLEyGkARrMM5v0ee786-Xc=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25434055/UFC_301_post_show_CLEAN.jpg",
        "publishedAt": "2024-05-05T07:18:26Z",
        "source": {
            "name": "MMA Fighting",
            "url": "https://www.mmafighting.com"
        },
        "id": "1c183d"
    },
    {
        "title": "There’s actually no such thing as vegetables. But here’s why you should eat them anyway",
        "description": "The term vegetable doesn’t exist botanically. Instead, vegetables are classified as the roots, stems, leaves and flowers of edible plants.",
        "content": "Get inspired by a weekly roundup on living well, made simple. Sign up for CNN’s Life, But Better newsletter for information and tools designed to improve your well-being.\nCNN —\nThe rumors are true: Vegetables aren’t real — that is, in botany, anyway.... [4213 chars]",
        "url": "https://www.cnn.com/2024/05/05/health/what-are-vegetables-nutrients-plants-wellness/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1437818837.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-05T07:00:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1478c0"
    },
    {
        "title": "Helldivers 2 No Longer Purchasable via Steam in Numerous Countries; Steam Offering Refunds",
        "description": "Helldivers 2 is no longer purchasable via Steam in numerous countries following the news that having a PSN account will become mandatory.",
        "content": "Helldivers 2 is no longer purchasable via Steam in numerous countries following the news that having a PSN account will become mandatory.\nAs covered some days ago, PC players will soon be required to create and link a PSN account in order to keep pla... [2272 chars]",
        "url": "https://wccftech.com/helldivers-2-no-longer-purchasable-steam-refunds/",
        "image": "https://cdn.wccftech.com/wp-content/uploads/2024/02/helldivers-2-game-master.jpg",
        "publishedAt": "2024-05-05T06:19:00Z",
        "source": {
            "name": "Wccftech",
            "url": "https://wccftech.com"
        },
        "id": "178d8e"
    },
    {
        "title": "US, Australian surfers were likely executed in vicious carjacking in Mexico: report",
        "description": "American Jack Carter Rhoad and Australian brothers Callum and Jake Robinson were killed in a carjacking gone wrong during a Mexico surf trip.",
        "content": "The American surfers and Australian brothers who were found dead on a surfing vacation in Mexico were likely killed when they refused to hand over their car to a trio of carjackers, according to a report.\nThe bodies of Jack Carter Rhoad, 30, and brot... [3898 chars]",
        "url": "https://nypost.com/2024/05/05/world-news/us-australian-surfers-were-likely-executed-in-vicious-carjacking-in-mexico-report/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/newspress-collage-6jvu3vz8g-1714889598527.jpg?quality=75&strip=all&1714875243&w=1024",
        "publishedAt": "2024-05-05T06:19:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "108f32"
    },
    {
        "title": "Kenan Thompson is supportive of college protests as long as they don’t involve his daughter in ‘SNL’ cold open",
        "description": "“Saturday Night Live” took on one of the top news stories of the past week on its latest episode, when cast members played concerned parents of New York City college kids involved in protests in the cold open over the weekend.",
        "content": "CNN —\n“Saturday Night Live” took on one of the top news stories of the past week on its latest episode, when cast members played concerned parents of New York City college kids involved in protests in the cold open over the weekend.\nOn Saturday’s epi... [2383 chars]",
        "url": "https://www.cnn.com/2024/05/05/entertainment/saturday-night-live-college-protests-kenan-thompson-cold-open/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/still-20598877-197090-still.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2024-05-05T06:12:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1f1dbd"
    },
    {
        "title": "Heartbreaking downfall of brilliant lawyer, 44, who walked out on his career and family after being engulfed by mental illness during COVID and who now lives on streets of LA as panhandler",
        "description": "Two years ago Rob Dart, 44, was an award winning attorney and doting father living in a $2 million South Pasadena home. But a mental health crisis during Covid saw him lose it all.",
        "content": "The relatives of a brilliant lawyer who walked out on his family and career amid a mental health spiral during Covid have spoken of their devastation after he ended up living on the streets of LA.\nTwo years ago Rob Dart, 44, was an award-winning atto... [6763 chars]",
        "url": "https://www.dailymail.co.uk/news/article-13384051/Lawyer-Rob-Dart-covid-breakdown-homeless-LA.html",
        "image": "https://i.dailymail.co.uk/1s/2024/05/05/06/84471389-0-image-m-76_1714886860537.jpg",
        "publishedAt": "2024-05-05T05:41:03Z",
        "source": {
            "name": "Daily Mail",
            "url": "https://www.dailymail.co.uk"
        },
        "id": "185803"
    },
    {
        "title": "UFC 301: Pantoja vs Erceg Prelim Results",
        "description": "See The Fight Results, Watch Post-Fight Interviews With The Prelims Winners And More From UFC 301: Pantoja vs Erceg, Live From Farmasi Arena In Rio de Janeiro, Brazil",
        "content": "It was “Brazil vs. The World” on Saturday at UFC 301 in Rio de Janeiro, and the home team got out to a solid lead through the preliminary card slate.\nLed by standout efforts from Alessandro Costa, Mauricio Ruffy, and Iasmin Lucindo, and punctuated by... [282 chars]",
        "url": "https://www.ufc.com/news/prelim-results-highlights-winner-interviews-ufc-301-pantoja-vs-erceg",
        "image": "https://dmxg5wxfqgb4u.cloudfront.net/styles/card/s3/2024-05/050424-Brito-Featured-Prelim-Hero-301.jpg?itok=EnW8qrxs",
        "publishedAt": "2024-05-05T05:23:14Z",
        "source": {
            "name": "UFC",
            "url": "https://www.ufc.com"
        },
        "id": "1faccf"
    },
    {
        "title": "Mystik Dan Delivers Kentucky Derby Victory for the Ages",
        "description": "In one of the tightest finishes in Derby history, Mystik Dan pulled off an upset that will go down in horse racing lore.",
        "content": "In one of the tightest finishes in Derby history, Mystik Dan pulled off an upset that will go down in horse racing lore.\nWalking by the Kentucky Derby winner’s circle after the biggest victory of his life, trainer Kenny McPeek held the hand of his da... [7393 chars]",
        "url": "https://www.si.com/horse-racing/2024/05/04/mystik-dan-kentucky-derby-photo-finish-victory-for-ages",
        "image": "https://images2.minutemediacdn.com/image/upload/c_crop,w_6000,h_3375,x_0,y_0/images/ImagnImages/mmsport/si-temp/01hx3gx4w59ashqfkevh",
        "publishedAt": "2024-05-05T04:48:40Z",
        "source": {
            "name": "Sports Illustrated",
            "url": "https://www.si.com"
        },
        "id": "1cd4c6"
    },
    {
        "title": "Chicago-area landlord charged with hate crimes after fatally stabbing 6-year-old and wounding his mom because they were Muslim, authorities say",
        "description": "A Chicago-area landlord was arrested and charged with murder and hate crimes after authorities said he stabbed and killed a 6-year-old boy and seriously wounded his mother, allegedly because the tenants are Muslim.",
        "content": "CNN —\nA Chicago-area landlord was arrested and charged with murder and hate crimes after authorities said he stabbed and killed a 6-year-old boy and seriously wounded his mother, allegedly because the tenants are Muslim.\nJoseph M. Czuba, 71, was char... [4253 chars]",
        "url": "https://www.cnn.com/2023/10/15/us/chicago-landlord-attack-muslim-boy-mother/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/231015172306-wadea-al-fayoume.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-10-15T23:22:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1a0c2b"
    },
    {
        "title": "Boy, mother were targeted in stabbing because of their Islamic faith: police",
        "description": "Joseph Czuba, 71, was charged with first-degree murder, attempted first-degree murder, aggravated battery with a deadly weapon and two counts of a hate crime,...",
        "content": "A Plainfield Township landlord who fatally stabbed a 6-year-old boy and seriously wounded his mother targeted them because of their Islamic faith and the Israel-Hamas war, according to authorities.\nJoseph Czuba, 71, was charged with first-degree murd... [3224 chars]",
        "url": "https://www.nbcchicago.com/news/local/boy-mother-stabbed-in-plainfield-twp-were-targeted-because-of-their-islamic-faith-police/3251248/",
        "image": "https://media.nbcchicago.com/2023/10/Large-boy-killed-plainfield-township-murder10-15-2023-15-50-06.png?resize=1200%2C675&quality=85&strip=all",
        "publishedAt": "2023-10-15T23:21:24Z",
        "source": {
            "name": "NBC Chicago",
            "url": "https://www.nbcchicago.com"
        },
        "id": "149e87"
    },
    {
        "title": "Sunday Night Football: Saquon Barkley, Darren Waller are active",
        "description": "Giants running back Saquon Barkley is dressed for Sunday Night Football.",
        "content": "Giants running back Saquon Barkley is dressed for Sunday Night Football. He was not among the team’s inactives.\nBarkley returns after missing the past three games with a sprained ankle. He injured his ankle in the Giants’ Week 2 victory over the Card... [912 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/sunday-night-football-saquon-barkley-darren-waller-are-active",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/97bfbb3/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F30%2Fc0%2F913bbd8d42fc8fe7f4acdd143415%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1692512259",
        "publishedAt": "2023-10-15T23:08:09Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "id": "14e607"
    },
    {
        "title": "Middle East on \"verge of the abyss,' UN warns as Gaza suffers and Israel prepares for offensive",
        "description": "Conditions in Gaza have deteriorated dangerously, experts say, with serious shortages of clean water and food as tens of thousands of Palestinians attempt to flee crippling airstrikes and an Israeli ground offensive.",
        "content": "Gaza and Jerusalem CNN —\nConditions in Gaza have deteriorated dangerously, experts say, with serious shortages of clean water and food as tens of thousands of Palestinians attempt to flee crippling airstrikes and an Israeli ground offensive.\nIsrael’s... [13726 chars]",
        "url": "https://www.cnn.com/2023/10/15/middleeast/israel-hamas-gaza-war-sunday-intl-hnk/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/231014224159-08-gaza-israel-101423.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-10-15T22:40:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "14e9f3"
    },
    {
        "title": "Suzanne Somers, 'Three's Company' actress, dead at 76",
        "description": "Suzanne Somers, the actress who lit up the small screen on “Three’s Company” and one of TV’s most iconic fitness pitchwomen, has died, according to a statement provided to CNN from her longtime publicist R. Couri Hay.",
        "content": "CNN —\nSuzanne Somers, the actress who lit up the small screen on “Three’s Company” and one of TV’s most iconic fitness pitchwomen, has died, according to a statement provided to CNN from her longtime publicist R. Couri Hay.\nShe was 76.\n“Suzanne Somer... [6141 chars]",
        "url": "https://www.cnn.com/2023/10/15/entertainment/suzanne-somers-death/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/231015160249-03-suzanne-somers-1979.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-10-15T22:20:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1bac17"
    },
    {
        "title": "Plainfield man stabs Palestinian American boy to death, wounds his mom because they were Muslim, police say",
        "description": "Joseph Czuba, 71, is charged with murder, attempted murder and two counts of a hate crime after he allegedly attacked the boy and his mother in Plainfield.",
        "content": "A boy was killed and a woman critically injured when they were stabbed by a man who targeted them because they were Muslim in southwest suburban Plainfield Township, police said.\nThe woman, 32, called 911 Saturday morning and told dispatchers that he... [4088 chars]",
        "url": "https://chicago.suntimes.com/news/2023/10/15/23918129/muslim-hate-crime-wadea-al-fayoume-plainfield-joseph-czuba-palestinian-israel-war-murder",
        "image": "https://cst.brightspotcdn.com/dims4/default/c11b112/2147483647/strip/true/crop/2000x1142+0+202/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2F1irVo80nPx6uUluA73MGwbsCqkw%3D%2F0x0%3A2000x1545%2F2000x1545%2Ffilters%3Afocal%281000x773%3A1001x774%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F25005155%2FUntitled_design__14_.png",
        "publishedAt": "2023-10-15T22:15:00Z",
        "source": {
            "name": "Chicago Sun-Times",
            "url": "https://chicago.suntimes.com"
        },
        "id": "1b7b86"
    },
    {
        "title": "Jimmy Garoppolo transported to hospital",
        "description": "The Raiders quarterback injured his back in the first half.",
        "content": "The Raiders have ruled out quarterback Jimmy Garoppolo.\nHeidi Fang of the Las Vegas Review-Journal reports that Garoppolo was transported via ambulance to a local hospital.\nHe was injured at the end of the first half but stayed in to complete the fie... [371 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jimmy-garoppolo-transported-to-hospital",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/3557a76/2147483647/strip/true/crop/4637x2608+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F99%2F2b%2F4bc0057b4e9881651b38e615af77%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1737815225",
        "publishedAt": "2023-10-15T22:11:42Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "id": "19c992"
    },
    {
        "title": "6-Year-Old Boy Fatally Stabbed in Anti-Muslim Attack, Police Say",
        "description": "The boy, who was stabbed more than two dozen times, and his mother were both wounded by their landlord on Saturday outside Chicago in an attack fueled by the war in the Middle East, officials said.",
        "content": "Mr. Rehab added, “We have full confidence in the authorities to investigate this heinous incident as a hate crime and to do so swiftly.”\nCAIR, citing text messages the boy’s mother sent to his father from the hospital that were shared with the advoca... [682 chars]",
        "url": "https://www.nytimes.com/2023/10/15/us/muslim-boy-stabbed-landlord-chicago.html",
        "image": "https://static01.nyt.com/images/2023/10/15/world/15xp-stabbing-promo/15xp-stabbing-promo-facebookJumbo.jpg",
        "publishedAt": "2023-10-15T21:38:34Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1d0fd5"
    },
    {
        "title": "EXCLUSIVE: Travis Kelce is spotted leaving Taylor Swift's Tribeca apartment in green Palm Angels tracksuit... as loved-up pair opt against watching Chiefs star's brother Jason play at MetLife after ni",
        "description": "EXCLUSIVE: Swift looked set to attend her second NFL game this week after watching her new beau, Kelce, and the Kansas City Chiefs beat the Denver Broncos on Thursday Night Football.",
        "content": "Travis Kelce was spotted leaving Taylor Swift's Tribeca apartment on Sunday afternoon as the couple decided against heading to MetLife Stadium to watch the Chiefs star's brother Jason face the Jets.\nSwift looked set to attend her second NFL game this... [6025 chars]",
        "url": "https://www.dailymail.co.uk/sport/nfl/article-12632821/Taylor-Swift-Travis-Kelce-MetLife-Stadium-Chiefs-Jason-Eagles-Jets.html",
        "image": "https://i.dailymail.co.uk/1s/2023/10/15/21/76591345-0-image-m-178_1697402630948.jpg",
        "publishedAt": "2023-10-15T20:44:06Z",
        "source": {
            "name": "Daily Mail",
            "url": "https://www.dailymail.co.uk"
        },
        "id": "125b43"
    },
    {
        "title": "Undeterred State Fair of Texas attendees file into Fair Park a day after shooting",
        "description": "The State Fair of Texas is delaying its Sunday opening by four hours after three people were wounded in a shooting at the fair the night before.",
        "content": "The State Fair of Texas delayed its Sunday opening by four hours after three people were wounded in a shooting at the fair the night before — but that didn’t deter the hundreds in attendance.\nThe fair opened at 2 p.m., letting customers back in for t... [5356 chars]",
        "url": "https://www.dallasnews.com/news/crime/2023/10/15/texas-state-fair-shooting-sunday-schedule/",
        "image": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/3GJB6kpV2YCPL-WXsfqNAsgCi3A=/830x467/smart/filters:no_upscale()/cloudfront-us-east-1.images.arcpublishing.com/dmn/DLYNXCIGDCNMXIC4SYSWQ5DIKA.jpg",
        "publishedAt": "2023-10-15T20:03:45Z",
        "source": {
            "name": "The Dallas Morning News",
            "url": "https://www.dallasnews.com"
        },
        "id": "1d1d4d"
    },
    {
        "title": "Rep. Jennifer Wexton Announces Rare Neurological Disorder Diagnosis",
        "description": "Ms. Wexton, a Democrat who disclosed a Parkinson’s diagnosis in April, will not seek re-election after learning she has progressive supranuclear palsy, for which there is no effective treatment.",
        "content": "In April, Ms. Wexton announced that she had been diagnosed with Parkinson’s disease, saying at the time that it would not stop her from continuing to live her life, or pursuing her political career.\n“I’m doing well, and I want to bring about as much ... [1065 chars]",
        "url": "https://www.nytimes.com/2023/09/18/us/politics/jennifer-wexton-progressive-supranuclear-palsy.html",
        "image": "https://static01.nyt.com/images/2023/09/18/us/politics/18xp-wexton1/18xp-wexton1-facebookJumbo.jpg",
        "publishedAt": "2023-09-18T18:38:44Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "16b814"
    },
    {
        "title": "Stock Market Holds Modest Gains As It Waits For The Fed; Chinese EV Stock Slumps",
        "description": "The stock market is trying to stay upbeat ahead of the Fed meeting this week.",
        "content": "The stock market weakened slightly in the past hour of trading, with the major indexes off the highs of the day. Investors are unsure ahead of the Federal Reserve's meeting this week.\nX\nEyes and ears will be on the Fed this week, with the latest meet... [5078 chars]",
        "url": "https://www.investors.com/market-trend/stock-market-today/stock-market-wary-as-it-waits-for-the-fed-new-arm-ipo-sinks/",
        "image": "https://www.investors.com/wp-content/uploads/2023/05/Stock-LiAutoL7-01-company.jpg",
        "publishedAt": "2023-09-18T17:46:00Z",
        "source": {
            "name": "Investor's Business Daily",
            "url": "https://www.investors.com"
        },
        "id": "1e5ad6"
    },
    {
        "title": "Microsoft’s former Surface chief Panos Panay is reportedly heading to Amazon",
        "description": "Panos Panay, the former head of Windows and Surface, is joining Amazon, Bloomberg reports. He’d replace Amazon’s former hardware boss in charge of Alexa and Echo, Dave Limp.",
        "content": "Panos Panay is reportedly joining Amazon, Bloomberg reports. The former Windows and Surface chief announced his departure from Microsoft earlier today, and Bloomberg reports that he’s moving to Seattle’s other giant tech company to oversee Amazon’s v... [797 chars]",
        "url": "https://www.theverge.com/2023/9/18/23879036/microsoft-panos-panay-amazon-hire-former-surface-windows-chief",
        "image": "https://cdn.vox-cdn.com/thumbor/3R_M280tYi09QKtk573LRhiHFcU=/0x0:4774x3176/1200x628/filters:focal(2387x1588:2388x1589)/cdn.vox-cdn.com/uploads/chorus_asset/file/24931924/1454311872.jpg",
        "publishedAt": "2023-09-18T17:39:45Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "id": "1b3add"
    },
    {
        "title": "The NFL Is Shipping Travis Kelce and Taylor Swift",
        "description": "A CBS announcer referenced Taylor Swift’s song “Blank Space” after Kansas City Chiefs tight end Travis Kelce scored a touchdown. Swift and Kelce are currently embroiled in dating rumors.",
        "content": "Travis Kelce and Taylor Swift. Photo-Illustration: Vulture. Photos: Getty Images\nThe Taylor Swift and Travis Kelce dating rumors are coming from inside the house. In a Sunday night football game on September 17, the Kansas City Chiefs tight end score... [1093 chars]",
        "url": "https://www.vulture.com/2023/09/taylor-swift-travis-kelce-dating-rumors.html",
        "image": "https://pyxis.nymag.com/v1/imgs/0da/4e8/449c03aa8288147f7d08d1c1cc090cb55a-kelce-swift.1x.rsocial.w1200.jpg",
        "publishedAt": "2023-09-18T17:30:36Z",
        "source": {
            "name": "Vulture",
            "url": "https://www.vulture.com"
        },
        "id": "1795f4"
    },
    {
        "title": "Russell Brand Cancels Comedy Dates After Sexual Assault Allegations",
        "description": "The comedian was scheduled to perform three dates in Britain this month. Now they’ve been postponed.",
        "content": "Russell Brand postponed the remaining dates of a comedy tour on Monday, two days after British news organizations published an investigation in which several women accused him of sexual assault.\nMr. Brand was scheduled to perform two shows as part of... [633 chars]",
        "url": "https://www.nytimes.com/2023/09/18/arts/russell-brand-tour-sexual-assault.html",
        "image": "https://static01.nyt.com/images/2023/09/18/world/18russell-brand/18russell-brand-facebookJumbo.jpg",
        "publishedAt": "2023-09-18T17:03:26Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "14d25a"
    },
    {
        "title": "Derna: Survivors dig mass graves for those killed in Libya's devastating floods",
        "description": "It’s quiet at the Martoba cemetery outside the Libyan city of Derna, despite the presence of dozens of volunteers. Men in white hazmat suits pour lime over the brown soil to seal the graves. Cement bricks jutting out of the heaps of dirt are the only signs of the hundreds of bodies buried underneath.",
        "content": "Derna, Libya CNN —\nIt’s quiet at the Martoba cemetery outside the Libyan city of Derna, despite the presence of dozens of volunteers. Men in white hazmat suits pour lime over the brown soil to seal the graves. Cement bricks jutting out of the heaps o... [4710 chars]",
        "url": "https://www.cnn.com/2023/09/18/africa/libya-mass-graves-derna-intl-cmd/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230918101021-01-libya-mass-graves.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-18T16:36:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1c2c1d"
    },
    {
        "title": "Apple’s new AirPods Pro with USB-C charging case is already $50 off on a preorder",
        "description": "Preorder the new AirPods Pro with USB-C for the same price as the older Lightning model. Plus, today’s deals on the Anker 3-in-1 Cube charger with MagSafe, the Samsung Galaxy S23 Plus, and more.",
        "content": "Apple’s biggest announcement last week at its “Wonderlust” event was, without a doubt, the iPhone 15’s change to USB-C, which is already having a ripple effect, as the AirPods Pro are also ditching Lightning for the port upgrade. Now, surprisingly, y... [2082 chars]",
        "url": "https://www.theverge.com/2023/9/18/23878472/apple-airpods-pro-usbc-anker-magsafe-charger-cube-samsung-deal-sale",
        "image": "https://cdn.vox-cdn.com/thumbor/4BSL9awm6HBSkW4yStsrDZFzIE8=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24043027/DSCF9466.jpg",
        "publishedAt": "2023-09-18T15:52:11Z",
        "source": {
            "name": "The Verge",
            "url": "https://www.theverge.com"
        },
        "id": "1609fb"
    },
    {
        "title": "Ukraine Overhauls Senior Ranks of Defense Ministry",
        "description": "All six of Ukraine’s deputy defense ministers were dismissed on Monday, a senior government official said, weeks after the defense minister was replaced.",
        "content": "Image Hanna Maliar, who has emerged as one of the most prominent Ukrainian officials giving information on the country’s counteroffensive, was among the officials dismissed. Credit... Sergei Supinsky/Agence France-Presse — Getty Images\nUkraine dismis... [2915 chars]",
        "url": "https://www.nytimes.com/live/2023/09/18/world/russia-ukraine-news",
        "image": "https://static01.nyt.com/images/2023/09/18/multimedia/18ukraine-briefing-promo-11am-mtlg/18ukraine-briefing-promo-11am-mtlg-facebookJumbo.jpg",
        "publishedAt": "2023-09-18T15:42:36Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1bc636"
    },
    {
        "title": "House GOP deal to avert shutdown gets icy reception from conservatives",
        "description": "House Republicans’ proposed short-term spending bill is facing internal opposition that could sink the measure and complicate the conference’s attempt to show unity in its opening offer to the Senate and White House. The stopgap bill to avoid a shutdown, which was unveiled Sunday night, got an icy reception from the right flank of the…",
        "content": "House Republicans’ proposed short-term spending bill is facing internal opposition that could sink the measure and complicate the conference’s attempt to show unity in its opening offer to the Senate and White House.\nThe stopgap bill to avoid a shutd... [5426 chars]",
        "url": "https://thehill.com/homenews/house/4209887-house-gop-deal-to-avert-shutdown-gets-icy-reception-from-conservatives/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2023/01/rosendalematt_010423gn2_w.jpg?w=1280",
        "publishedAt": "2023-09-18T15:39:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "1fcebe"
    },
    {
        "title": "Stocks making the biggest moves premarket: DASH, ARM, PYPL",
        "description": "These are the stocks making headlines in premarket trading Monday.",
        "content": "Check out the companies making headlines in premarket trading.\nPayPal – Shares of the payments giant fell more than 1% premarket after MoffettNathanson downgraded the stock to market perform from outperform and cut its price target 10 days before Pay... [1254 chars]",
        "url": "https://www.cnbc.com/2023/09/18/stocks-making-the-biggest-moves-premarket-dash-arm-pypl.html",
        "image": "https://image.cnbcfm.com/api/v1/image/106516157-1588351785968gettyimages-1209050413.jpeg?v=1695040122&w=1920&h=1080",
        "publishedAt": "2023-09-18T12:28:42Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "id": "125d9d"
    },
    {
        "title": "Hunter Biden sues the IRS, alleging agents illegally released his tax information",
        "description": "Hunter Biden sued the Internal Revenue Service on Monday, alleging its agents illegally released his tax information and that the agency failed to protect his private records.",
        "content": "CNN —\nHunter Biden sued the Internal Revenue Service on Monday, alleging its agents illegally released his tax information and that the agency failed to protect his private records.\nPresident Joe Biden’s son alleges the IRS unlawfully disclosed his t... [2923 chars]",
        "url": "https://www.cnn.com/2023/09/18/politics/hunter-biden-irs/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230913175420-hunter-biden-file-091323.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-18T11:41:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "15dea8"
    },
    {
        "title": "Tencent investors Naspers and Prosus announce abrupt departure of CEO",
        "description": "The immediate and mutually agreed departure of Naspers and Prosus CEO Bob van Dijk underscores a complicated few years.",
        "content": "Bob van Dijk Bloomberg | Bloomberg | Getty Images\nThe immediate and mutually agreed departure of Naspers and Prosus CEO Bob van Dijk underscores a complicated few years for a firm seen riding on the coattails of its holdings in Chinese tech giant, Te... [2344 chars]",
        "url": "https://www.cnbc.com/2023/09/18/tencent-investors-naspers-and-prosus-announce-abrupt-departure-of-ceo.html",
        "image": "https://image.cnbcfm.com/api/v1/image/106123387-1568185989975gettyimages-1166232188.jpeg?v=1695036586&w=1920&h=1080",
        "publishedAt": "2023-09-18T11:29:11Z",
        "source": {
            "name": "CNBC",
            "url": "https://www.cnbc.com"
        },
        "id": "1fab8a"
    },
    {
        "title": "House GOP unveils opening move in bid to prevent a shutdown",
        "description": "The House this week will look to take up a GOP-crafted continuing resolution to fund the government beyond Sept. 30 — the conference’s opening move in Congress’s quest to avoid an end-of-the-month shutdown. A coalition of Republicans announced an internal deal for the stopgap bill Sunday night, which would extend the funding deadline by a month,…",
        "content": "The House this week will look to take up a GOP-crafted continuing resolution to fund the government beyond Sept. 30 — the conference’s opening move in Congress’s quest to avoid an end-of-the-month shutdown.\nA coalition of Republicans announced an int... [8271 chars]",
        "url": "https://thehill.com/homenews/house/4209517-house-gop-unveils-opening-move-in-bid-to-prevent-a-shutdown/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2023/08/64eb97b95a8fc4.19675934.jpeg?w=1280",
        "publishedAt": "2023-09-18T10:59:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "1f1559"
    },
    {
        "title": "US shutdown looms: Top House Republican Kevin McCarthy faces crucial test",
        "description": "U.S. House Speaker Kevin McCarthy is facing the biggest challenge of his eight months as the top Republican in the U.S. Congress, as he tries to muster his fractured caucus to avoid a government shutdown in less than two weeks without losing his speakership.",
        "content": "U.S. House Speaker Kevin McCarthy (R-CA) addresses the 5th annual Congressional Hackathon on Capitol Hill in Washington, U.S., September 14, 2023. REUTERS/Evelyn Hockstein Acquire Licensing Rights\nWASHINGTON, Sept 18 (Reuters) - U.S. House Speaker Ke... [5384 chars]",
        "url": "https://www.reuters.com/world/us/us-shutdown-looms-top-house-republican-kevin-mccarthy-faces-crucial-test-2023-09-18/",
        "image": "https://www.reuters.com/resizer/w8_j1lIoAPQbjce3v0tgo2a73EE=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/4SRZ56YMXRPDZJIJCALQLH7XKM.jpg",
        "publishedAt": "2023-09-18T10:17:00Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "id": "1751c3"
    },
    {
        "title": "The Hollywood Reporter",
        "description": "In an internal email, the U.K. network said it was looking into whether people at the channel \"had knowledge of the alleged behaviours\"",
        "content": "Channel 4, the U.K. network that helped drive Russell Brand’s career in its early days, has now launched its own investigation into sexual assault and misconduct allegations against the actor and TV host that arose over the weekend in a major expose.... [1399 chars]",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/russell-brand-allegations-channel-4-investigation-1235592627/",
        "image": "https://www.hollywoodreporter.com/wp-content/uploads/2023/09/Russell-B.jpg?w=1024",
        "publishedAt": "2023-09-18T10:16:23Z",
        "source": {
            "name": "Hollywood Reporter",
            "url": "https://www.hollywoodreporter.com"
        },
        "id": "120c15"
    },
    {
        "title": "Naspers/Prosus CEO steps down, M&A chief Tu takes the helm",
        "description": "Bob van Dijk has stepped down as the long-time CEO of Dutch technology investor Prosus and its South African parent company Naspers, with M&A chief Ervin Tu taking both positions on an interim basis.",
        "content": "Bob van Dijk, CEO of e-commerce group Naspers, poses for a photograph in front of the company logo after holding a media briefing in Johannesburg, South Africa, October 9, 2019. REUTERS/Siphiwe Sibeko/File photo Acquire Licensing Rights\nSummary\nCompa... [2882 chars]",
        "url": "https://www.reuters.com/technology/naspers-prosus-ceo-bob-van-dijk-steps-down-2023-09-18/",
        "image": "https://www.reuters.com/resizer/IutNzGX_AKQfIvf3y6GvCxbev-0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/OC2PVVRQ6NOYLFNQOHVPDORUKI.jpg",
        "publishedAt": "2023-09-18T09:52:00Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "id": "11b328"
    },
    {
        "title": "Lionel Messi: Even when Inter Miami start doesn’t play he’s still star of the show MLS",
        "description": "It was a tantalizing reveal, the lid of a pizza box being flipped open to show Lionel Messi’s Friday night dinner – a freshly baked pie. But in that moment, many of his fans completely lost their appetite.",
        "content": "CNN —\nIt was a tantalizing reveal, the lid of a pizza box being flipped open to show Lionel Messi’s Friday night dinner – a freshly baked pie. But in that moment, some of his many fans completely lost their appetite.\nIt wasn’t his choice of toppings ... [6759 chars]",
        "url": "https://www.cnn.com/2023/09/18/sport/lionel-messi-inter-miami-atlanta-united-mls/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230918094658-messi-tease.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-18T09:26:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "14c2d6"
    },
    {
        "title": "Hurricane Nigel forms, expected to rapidly intensify into major hurricane",
        "description": "Nigel strengthened into a hurricane overnight and is expected to rapidly strengthen by Tuesday, the National Hurricane Center said.",
        "content": "TAMPA, Fla. (WFLA) — Nigel strengthened into a hurricane overnight, becoming the 14th named storm of the Atlantic hurricane season.\nAccording to the National Hurricane Center, Nigel is expected to rapidly strengthen by Tuesday, the National Hurricane... [1176 chars]",
        "url": "https://www.wfla.com/weather/tracking-the-tropics/hurricane-nigel-forms-expected-to-rapidly-intensify-into-major-hurricane/",
        "image": "https://www.wfla.com/wp-content/uploads/sites/71/2023/09/TROPICS-SATELLITE-INFRARED-2022-10.png?w=1280",
        "publishedAt": "2023-09-18T09:22:39Z",
        "source": {
            "name": "WFLA",
            "url": "https://www.wfla.com"
        },
        "id": "1bafe3"
    },
    {
        "title": "2 suspects arrested, 3rd sought after deadly opioid exposure at Bronx day care",
        "description": "Two suspects have been indicted and a third is sought by police in the deadly opioid exposure at a day care in the Bronx.",
        "content": "One child has died and three others were hospitalized after what officials say was a deadly exposure to opioids at the day care. Janice Yu has the latest.\nKINGSBRIDGE, The Bronx (WABC) -- Two suspects have been indicted and a third is sought by polic... [3733 chars]",
        "url": "https://abc7ny.com/bronx-child-killed-day-care-incident/13795965/",
        "image": "https://cdn.abcotvs.com/dip/images/13791310_091623-bronx-daycare-death.jpg?w=1600",
        "publishedAt": "2023-09-18T09:11:15Z",
        "source": {
            "name": "WABC-TV",
            "url": "https://abc7ny.com"
        },
        "id": "1400d2"
    },
    {
        "title": "‘Winning Time: The Rise Of The Lakers Dynasty’ Canceled by HBO",
        "description": "'Winning Time: The Rise Of The Lakers Dynasty' Canceled After Two Seasons",
        "content": "Winning Time: The Rise of the Lakers Dynasty has come to an end.\nAfter the second season finale Sunday, Creator Max Borenstein confirmed the news on X.\n“Not the ending that we had in mind,” he wrote. “But nothing but gratitude and love.”\nDirector Sal... [2059 chars]",
        "url": "https://deadline.com/2023/09/winning-time-the-rise-of-the-lakers-dynasty-canceled-two-seasons-1235549093/",
        "image": "https://deadline.com/wp-content/uploads/2023/08/quincy-isaiah-jason-segel-adrien-brody-john-c-reilly-spencer-garrett-jason-clarke.jpeg?w=1000",
        "publishedAt": "2023-09-18T02:52:00Z",
        "source": {
            "name": "Deadline",
            "url": "https://deadline.com"
        },
        "id": "12f96c"
    },
    {
        "title": "‘Winning Time’ Canceled at HBO After Two Seasons",
        "description": "Winning Time has been canceled at HBO after two seasons and after finale aired.",
        "content": "Winning Time is winning no more.\nHBO confirmed that it has canceled the series — full title Winning Time: The Rise of the Lakers Dynasty — after two seasons. The news was a surprise, coming only moments after the network aired the second-season final... [3228 chars]",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/winning-time-canceled-hbo-two-seasons-series-finale-1235592576/",
        "image": "https://www.hollywoodreporter.com/wp-content/uploads/2023/06/quincy-isaiah-solomon-hughes-delante-desouza-austin-aaron-jimel-atkins-devaughn-nixon.jpg?w=1024",
        "publishedAt": "2023-09-18T02:42:01Z",
        "source": {
            "name": "Hollywood Reporter",
            "url": "https://www.hollywoodreporter.com"
        },
        "id": "16f10a"
    },
    {
        "title": "Tyreek Hill touchdown gives Dolphins 17-3 halftime lead over Patriots",
        "description": "The Patriots scored their first points with 1:49 left on the clock in the second quarter of Sunday's matchup with the Dolphins.",
        "content": "The Patriots scored their first points with 1:49 left on the clock in the second quarter of Sunday’s matchup with the Dolphins.\nBut Miami came right back down the field to score a touchdown and take a 17-3 lead into halftime.\nQuarterback Tua Tagovail... [1527 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/tyreek-hill-touchdown-gives-dolphins-17-3-halftime-lead-over-patriots",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/bbb6146/2147483647/strip/true/crop/4136x2327+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.amazonaws.com%2Fbrightspot%2Fcc%2F17%2F678e064a4f51a47c056c4e706d18%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1687642113",
        "publishedAt": "2023-09-18T01:53:04Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "id": "1e4107"
    },
    {
        "title": "California lawsuit says oil giants deceived public on climate, seeks funds for storm damage",
        "description": "The state of California filed a lawsuit against some of the world’s largest oil and gas companies, claiming they deceived the public about the risks of fossil fuels now faulted for climate change-related storms and wildfires that caused billions of dollars in damage, officials said Saturday.",
        "content": "GOOD MORNING TO YOU. THANK YOU, BRIAN. NEW THIS MORNING, A NATION LEADING CLIMATE ACTION BILL HEADS TO THE GOVERNOR’S DESK TODAY. IT IS REQUIRING ACTION FROM SOME OF THE LARGEST CORPORATIONS, NOT JUST IN OUR STATE, BUT ACTUALLY THE WORLD. KCRA 3’S ER... [6945 chars]",
        "url": "https://www.kcra.com/article/california-lawsuit-oil-climate-funds-storm-damage/45182150",
        "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/oil-6507a60a7d440.jpg?crop=1.00xw:0.854xh;0,0&resize=1200:*",
        "publishedAt": "2023-09-18T01:38:00Z",
        "source": {
            "name": "KCRA Sacramento",
            "url": "https://www.kcra.com"
        },
        "id": "1b4a86"
    },
    {
        "title": "LA sheriff’s deputy dies after being shot in patrol car",
        "description": "A Los Angeles sheriff’s deputy has died after being shot while in his patrol car, his office said. Ryan Clinkunbroomer, in uniform and working in a patrol car from the sheriff’s station in Palmdale, California on Saturday, was discovered unconscious by a good samaritan, and they immediately reported it to personnel at the station, LA…",
        "content": "A Los Angeles sheriff’s deputy has died after being shot while in his patrol car, his office said.\nRyan Clinkunbroomer, in uniform and working in a patrol car from the sheriff’s station in Palmdale, California on Saturday, was discovered unconscious ... [2402 chars]",
        "url": "https://thehill.com/homenews/state-watch/4209320-los-angeles-sheriffs-deputy-dies-shot-in-patrol-car/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2023/09/GettyImages-943697000-1-1-3-2-2.jpg?w=1280",
        "publishedAt": "2023-09-18T01:33:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "1c7f6a"
    },
    {
        "title": "‘Suits’ Creator Aaron Korsh On Billy Miller’s Passing: “A Gentle Man”",
        "description": "'Suits' Creator Aaron Korsh On Billy Miller's Passing: \"A Funny, Smart, Kind, Gentle Man\"",
        "content": "Suits creator Aaron Korsh on Sunday paid tribute to soap actor Billy Miller, who died Friday, Sept. 15 in Austin, Texas. He was 43.\nThough Miller is best known for his roles on The Young and the Restless and General Hospital, he played Marcus Specter... [801 chars]",
        "url": "https://deadline.com/2023/09/suits-creator-aaron-korsh-billy-miller-death-1235549038/",
        "image": "https://deadline.com/wp-content/uploads/2023/09/GettyImages-451068318.jpg?w=1024",
        "publishedAt": "2023-09-18T01:21:00Z",
        "source": {
            "name": "Deadline",
            "url": "https://deadline.com"
        },
        "id": "13c2ab"
    },
    {
        "title": "Plane crash: 2 pilots killed after colliding upon landing at National Championship Air Races ID'd",
        "description": "Two pilots were killed in a Reno air races plane crash on Sunday, the Reno Air Racing Association said. They were ID'd as Nick Macy and Chris Rushing.",
        "content": "Pilots based in Van Nuys and Northern California were killed in a crash at a Reno air racing event Sunday.\nRENO, Nev. -- Two pilots were killed Sunday after their planes collided while landing at the National Championship Air Races in Reno, Nevada, t... [1730 chars]",
        "url": "https://abc13.com/plane-crash-today-reno-air-races-nevada/13794743/",
        "image": "https://cdn.abcotvs.com/dip/images/13795109_091723-kabc-6pm-reno-planes-crash-vid.jpg?w=1600",
        "publishedAt": "2023-09-18T00:56:15Z",
        "source": {
            "name": "KTRK-TV",
            "url": "https://abc13.com"
        },
        "id": "18f4b3"
    },
    {
        "title": "House GOP strikes internal deal as shutdown approaches",
        "description": "Two critical factions of the House Republican Conference reached agreement on a bill to avoid a government shutdown for another month, cutting discretionary spending for the duration, along with the bulk of a House GOP bill to change policies at the border. The hope is to bring the continuing resolution (CR) deal, crafted by leaders in the…",
        "content": "Two critical factions of the House Republican Conference reached agreement on a bill to avoid a government shutdown for another month, cutting discretionary spending for the duration, along with the bulk of a House GOP bill to change policies at the ... [5322 chars]",
        "url": "https://thehill.com/homenews/house/4209325-house-gop-reaches-short-term-spending-deal-with-cuts-and-border-policy-changes/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2023/09/Top-Dome_120822_AP_Mariam-Zuhaib-.jpg?w=1280",
        "publishedAt": "2023-09-18T00:42:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "144ec9"
    },
    {
        "title": "Billy Miller, ‘The Young & the Restless' and ‘General Hospital' star, dead at 43",
        "description": "Billy Miller, best known for his role on daytime TV dramas such as \"The Young and the Restless\" and \"General Hospital,\" has died. He was 43.",
        "content": "Originally appeared on E! Online\nThe soap world has lost a veteran star.\nBilly Miller, best known for his role on daytime TV dramas such as \"The Young and the Restless\" and \"General Hospital,\" has died. He was 43.\nHis manager confirmed the news to mu... [1736 chars]",
        "url": "https://www.nbcdfw.com/entertainment/entertainment-news/billy-miller-the-young-the-restless-and-general-hospital-star-dead-at-43/3340272/",
        "image": "https://media.nbcdfw.com/2023/09/GettyImages-451068318.jpg?quality=85&strip=all&resize=1200%2C675",
        "publishedAt": "2023-09-17T23:59:05Z",
        "source": {
            "name": "NBC 5 Dallas-Fort Worth",
            "url": "https://www.nbcdfw.com"
        },
        "id": "1f32ff"
    },
    {
        "title": "Halle Berry Says Drake Used Slime Photo Without Her Permission",
        "description": "Halle Berry is speaking out after Drake posted a photo of her getting slimed at the Kids' Choice Awards years ago to promote his new song.",
        "content": "Watch : Halle Berry Talks Redefining Herself After 30 Years at 2021 PCAs\nHalle Berry minced no words after Drake used a photo of her without her permission to promote his new song.\nOn Sept. 15, the Oscar winner shared a quote on Instagram that read, ... [869 chars]",
        "url": "https://www.eonline.com/news/1385744/halle-berry-says-drake-used-slime-photo-without-her-permission",
        "image": "https://akns-images.eonline.com/eol_images/Entire_Site/2023817/rs_1200x1200-230917164741-1200-halle-berry-drake-cjh-091723.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
        "publishedAt": "2023-09-17T23:53:00Z",
        "source": {
            "name": "E! NEWS",
            "url": "https://www.eonline.com"
        },
        "id": "1c5176"
    },
    {
        "title": "California Governor to Sign Landmark Climate Disclosure Bill",
        "description": "The first-in-the-nation law will compel major companies to publicly disclose their carbon dioxide emissions and could have national repercussions.",
        "content": "Gov. Gavin Newsom of California said on Sunday that he would sign a landmark climate bill that passed the state’s legislature last week requiring major companies to publicly disclose their greenhouse gas emissions, a move with national and global rep... [856 chars]",
        "url": "https://www.nytimes.com/2023/09/17/climate/california-climate-disclosure-law.html",
        "image": "https://static01.nyt.com/images/2023/09/17/multimedia/17cli-california-zhwv/17cli-california-zhwv-facebookJumbo.jpg",
        "publishedAt": "2023-09-17T23:34:18Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1ba21a"
    },
    {
        "title": "Teyana Taylor and Iman Shumpert are separated",
        "description": "Teyana Taylor and her husband, former professional basketball player Iman Shumpert, have split.",
        "content": "CNN —\nTeyana Taylor and her husband, former professional basketball player Iman Shumpert, have split.\nThe singer and actress shared the news Sunday in a statement on Instagram.\n“AHT AHT! Not too much on my bestie!,” the caption reads on a photo of th... [2034 chars]",
        "url": "https://www.cnn.com/2023/09/17/entertainment/teyana-taylor-iman-shumpert-separated/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230917175732-teyana-taylor-iman-shumpert-2022-restricted.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-17T23:27:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1a409e"
    },
    {
        "title": "Sunday Night Football: Terron Armstead, Jonathan Jones among Dolphins-Patriots inactives",
        "description": "The Dolphins won’t have two of their key players as they take on the Patriots for Sunday Night Football.",
        "content": "The Dolphins won’t have two of their key players as they take on the Patriots for Sunday Night Football.\nOffensive tackle Terron Armstead and linebacker Jaelan Phillips are both inactive after they were questionable for the contest. Armstead was list... [839 chars]",
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/sunday-night-football-terron-armstead-jonathan-jones-among-dolphins-patriots-inactives",
        "image": "https://nbcsports.brightspotcdn.com/dims4/default/b0983f4/2147483647/strip/true/crop/3546x1995+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.amazonaws.com%2Fbrightspot%2Fbb%2F27%2Fb3b85df54f9d9ea57b95b96e8fbf%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1586681039",
        "publishedAt": "2023-09-17T23:22:06Z",
        "source": {
            "name": "NBC Sports",
            "url": "https://www.nbcsports.com"
        },
        "id": "16e8ca"
    },
    {
        "title": "Rolling Stone co-founder removed from Rock & Roll Hall of Fame board",
        "description": "Jann Wenner was removed from the board of the Rock & Roll Hall of Fame Foundation after remarks in an interview that were criticized as being sexist and racist.",
        "content": "Listen 3 min Share Comment on this story Comment\nJann Wenner, the co-founder of Rolling Stone magazine who also helped found the Rock & Roll Hall of Fame Foundation, has been removed from the hall’s board after an interview in which he made comments ... [3324 chars]",
        "url": "https://www.washingtonpost.com/style/2023/09/17/rolling-stone-founder-board-removed/",
        "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MKVXCPBQTJBGSXKHOVQS3TSYIQ.jpg&w=1440",
        "publishedAt": "2023-09-17T12:00:00Z",
        "source": {
            "name": "The Washington Post",
            "url": "https://www.washingtonpost.com"
        },
        "id": "1e5928"
    },
    {
        "title": "Ukrainian drones strike Crimea, Moscow: Russia",
        "description": "Russia said that it intercepted a Ukrainian attack on Crimea on Sunday, with Ukrainian drones also attacking Moscow. Ukraine has launched a series of attacks targeting Crimea in recent days in its much anticipated counteroffensive against Russia. Russia’s defense ministry said Sunday that its air defense systems took down at least six drones that were targeting Crimea, Reuters…",
        "content": "Russia said that it intercepted a Ukrainian attack on Crimea on Sunday, with Ukrainian drones also attacking Moscow.\nUkraine has launched a series of attacks targeting Crimea in recent days in its much anticipated counteroffensive against Russia. Rus... [1342 chars]",
        "url": "https://thehill.com/policy/international/4208680-ukrainian-drones-strike-crimea-moscow-russia/",
        "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/russianflag_12032011_getty.jpg?w=1280",
        "publishedAt": "2023-09-17T11:42:00Z",
        "source": {
            "name": "The Hill",
            "url": "https://thehill.com"
        },
        "id": "19df67"
    },
    {
        "title": "Letter shows Pope Pius XII probably knew about Holocaust early on",
        "description": "The letter found in the Vatican archives conflicts with the Holy See's official position at the time that the information it had was vague and unverified.",
        "content": "[1/2] A man opens a door leading to the shelves where folders containing documents on Pope Pius XII, who reigned from 1939-1958, are stored inside the Vatican archives ahead of the full opening of the secret archives to scholars on March 2, at the Va... [3594 chars]",
        "url": "https://www.reuters.com/world/letter-shows-pope-pius-xii-probably-knew-about-holocaust-early-2023-09-17/",
        "image": "https://www.reuters.com/resizer/v4wd77ikfEdobnpIsTKKLKpLcAw=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/6WMONX5I3BLTHELCYZHEMFNZVU.jpg",
        "publishedAt": "2023-09-17T10:23:00Z",
        "source": {
            "name": "Reuters",
            "url": "https://www.reuters.com"
        },
        "id": "1af96e"
    },
    {
        "title": "A Los Angeles sheriff's deputy was fatally shot inside his patrol car, officials say",
        "description": "A Los Angeles County sheriff’s deputy died after he was shot inside his patrol car Saturday evening, authorities said.",
        "content": "CNN —\nA Los Angeles County sheriff’s deputy died after he was shot inside his patrol car Saturday evening, authorities said.\nDeputy Ryan Clinkunbroomer, 30, was found unconscious by a civilian in his patrol car around 6 p.m. near the sheriff’s statio... [2790 chars]",
        "url": "https://www.cnn.com/2023/09/17/us/los-angeles-sheriffs-deputy-shot-palmdale/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230917031838-02-palmdale-officer-shooting-scene.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-17T09:46:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1c074c"
    },
    {
        "title": "8 Major Takeaways From the New Book About Elon Musk",
        "description": "The book had some eye-popping details — from details on Elon Musk's relationship with his father to his \"hard core\" work ethic and \"demon mode.\"",
        "content": "Elon Musk's relationship with his father massively affected his personality and outlook on the world.\nElon Musk's relationship with his father impacted his personality and outlook on the world. Gianliuigi Guercia/Getty Images\nOne character who appear... [1915 chars]",
        "url": "https://www.businessinsider.com/new-book-about-elon-musk-walter-isaacson-biography-takeaways-2023-9",
        "image": "https://i.insider.com/65034aea992da60019ec9c1b?width=1200&format=jpeg",
        "publishedAt": "2023-09-17T09:24:00Z",
        "source": {
            "name": "Business Insider",
            "url": "https://www.businessinsider.com"
        },
        "id": "135b48"
    },
    {
        "title": "How an auto workers strike 87 years ago transformed America",
        "description": "During the final days of 1936, about 50 autoworkers at General Motors shut down their machines at Fisher Body Plant No. 2 in Flint, Michigan, and sat down.",
        "content": "New York CNN —\nDuring the final days of 1936, about 50 autoworkers at General Motors shut down their machines at Fisher Body Plant No. 2 in Flint, Michigan, and sat down.\nThe workers, members of the tiny United Automobile Workers union founded just a... [5613 chars]",
        "url": "https://www.cnn.com/2023/09/17/business/sit-down-uaw-strike-america/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230915122731-01-gm-sit-down-strike-flint-mi-1937-file.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-17T07:16:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "1fffd1"
    },
    {
        "title": "How a Yale Student’s Rape Accusation Exposed Her to a Defamation Lawsuit",
        "description": "The woman’s allegation led to the expulsion of Saifullah Khan, who was acquitted in a criminal trial. His lawsuit is now challenging these disciplinary hearings.",
        "content": "The woman said she woke in the middle of the night to find Mr. Khan on top of her. She tried to push him off, she said, and in the morning, found herself naked, even though she remembered lying down fully clothed. She had bruising on her legs and saw... [902 chars]",
        "url": "https://www.nytimes.com/2023/09/17/us/yale-rape-case-defamation.html",
        "image": "https://static01.nyt.com/images/2023/09/16/multimedia/16nat-yale-qjcg/16nat-yale-qjcg-facebookJumbo.jpg",
        "publishedAt": "2023-09-17T07:00:23Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "187a74"
    },
    {
        "title": "New ISS crew arrives on Soyuz",
        "description": "A Soyuz spacecraft delivered a new crew to the International Space Station Sept. 15 as NASA and Roscosmos updated plans for later missions.",
        "content": "BRUSSELS — A Soyuz spacecraft delivered a new crew to the International Space Station Sept. 15 as NASA and Roscosmos updated plans for later missions.\nA Soyuz-2.1a rocket lifted off from the Baikonur Cosmodrome at 11:44 a.m. Eastern and placed the So... [3077 chars]",
        "url": "https://spacenews.com/new-iss-crew-arrives-on-soyuz/",
        "image": "https://spacenews.com/wp-content/uploads/2023/09/53191330465_0f0ab0016a_k.jpg",
        "publishedAt": "2023-09-17T05:33:51Z",
        "source": {
            "name": "SpaceNews",
            "url": "https://spacenews.com"
        },
        "id": "1fbce7"
    },
    {
        "title": "North Korea's Kim visits a Russian university and aquarium as state media highlight military talks",
        "description": "A day after inspecting Russia’s nuclear-capable bombers and other advanced weapons, North Korean leader Kim Jong Un was in a lighter mode on Sunday, touring a university and watching a walrus show at Russia’s biggest aquarium as he continued a closely watched trip to Russia’s Far East.",
        "content": "SEOUL, South Korea (AP) — A day after inspecting Russia’s nuclear-capable bombers and other advanced weapons, North Korean leader Kim Jong Un was in a lighter mode on Sunday, touring a university and watching a walrus show at a Russian aquarium as he... [5584 chars]",
        "url": "https://apnews.com/article/north-korea-russia-kim-jong-un-putin-7f9fad83f4e56c684c11b9fffbd047e8",
        "image": "https://dims.apnews.com/dims4/default/3b09be9/2147483647/strip/true/crop/4143x2330+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F4a%2Feef2289ab4f76e3b415342ed6edc%2F42de3774670a40c4886ab1f4db5fc632",
        "publishedAt": "2023-09-17T05:19:00Z",
        "source": {
            "name": "The Associated Press",
            "url": "https://apnews.com"
        },
        "id": "1a5340"
    },
    {
        "title": "NFL Player Props Week 2: Sunday’s Picks Include Drake London and Courtland Sutton",
        "description": "Heading into Week 2 of the NFL season, here are our top NFL player prop bets for the week, including action on Drake London and Courtland Sutton.",
        "content": "There’s a lot of overlap between fantasy football and NFL betting. In no area is this more prominent than in NFL prop bets. With thousands of player props on the board every week, the lines aren’t as sharp as sides and totals. This is how we take adv... [9606 chars]",
        "url": "https://www.profootballnetwork.com/nfl-player-props-week-2-sunday-2023-betting/",
        "image": "https://static.profootballnetwork.com/wp-content/uploads/2023/09/16132004/nfl-player-props-week-2-sunday-2023-betting-1024x683.jpg",
        "publishedAt": "2023-09-17T04:38:40Z",
        "source": {
            "name": "Pro Football Network",
            "url": "https://www.profootballnetwork.com"
        },
        "id": "13be6b"
    },
    {
        "title": "Is one of Russia’s oldest allies slipping from the Kremlin’s orbit?",
        "description": "The arrival of US soldiers for a peacekeeper training exercise in Armenia has rankled the Russian government, which has for decades acted as the sole security guarantor for the former Soviet republic. The 10-day “Eagle Partner” exercise, which began Monday, involves 85 US and 175 Armenian soldiers and aims to prepare the Armenians to take part in international peacekeeping missions.",
        "content": "CNN —\nThe arrival of US soldiers for a peacekeeper training exercise in Armenia has rankled the Russian government, which has for decades acted as the sole security guarantor for the former Soviet republic. The 10-day “Eagle Partner” exercise, which ... [10511 chars]",
        "url": "https://www.cnn.com/2023/09/17/world/armenia-russia-kremlin-us-intl/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230915150004-01-armenia-russia-kremlin.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-17T04:07:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "19aa6c"
    },
    {
        "title": "Las Vegas strip club Larry Flynt's Hustler Club offering free lap dances after cyberattack",
        "description": "Larry Flynt's Hustler Club in Las Vegas says it's offering free luggage storage and airport pickup for people who experience delays in check-in, as well as a complimentary $1,200 platinum VIP membership and lap dances, according to TMZ.",
        "content": "One strip club in Las Vegas is offering free lap dances to customers who are impacted by a cyberattack at MGM Resorts.\nLarry Flynt’s Hustler Club in Las Vegas says it’s offering free luggage storage and airport pickup for people who experience delays... [1849 chars]",
        "url": "https://nypost.com/2023/09/17/las-vegas-strip-club-larry-flynts-hustler-club-offering-free-lap-dances-after-cyberattack/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2023/09/newspress-collage-myh67zngo-1694922659893.jpg?quality=75&strip=all&1694908287&w=1024",
        "publishedAt": "2023-09-17T04:07:00Z",
        "source": {
            "name": "New York Post ",
            "url": "https://nypost.com"
        },
        "id": "1f0eeb"
    },
    {
        "title": "In Risky Hunt for Secrets, U.S. and China Expand Global Spy Operations",
        "description": "The nations are taking bold steps in the espionage shadow war to try to collect intelligence on leadership thinking and military capabilities.",
        "content": "As China’s spy balloon drifted across the continental United States in February, American intelligence agencies learned that President Xi Jinping of China had become enraged with senior Chinese military generals.\nThe spy agencies had been trying to u... [816 chars]",
        "url": "https://www.nytimes.com/2023/09/17/us/politics/us-china-global-spy-operations.html",
        "image": "https://static01.nyt.com/images/2023/09/14/us/politics/00dc-china-intel/00dc-china-intel-facebookJumbo.jpg",
        "publishedAt": "2023-09-17T04:01:16Z",
        "source": {
            "name": "The New York Times",
            "url": "https://www.nytimes.com"
        },
        "id": "1d4429"
    },
    {
        "title": "Libya floods: Death toll rises to 11,300 in Derna, severely decomposing bodies found in the sea",
        "description": "The death toll from devastating flooding in Libya’s eastern coastal city of Derna has risen to at least 11,300, according to a UN report released Saturday, even as continuing search efforts are expected to find more victims.",
        "content": "CNN —\nThe death toll from devastating flooding in Libya’s eastern coastal city of Derna has risen to at least 11,300, according to a UN report released Saturday, even as continuing search efforts are expected to find more victims.\nA further 170 peopl... [2963 chars]",
        "url": "https://www.cnn.com/2023/09/16/world/libya-flood-death-toll-rise-derna-intl-hnk/index.html",
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/230916070516-05-derna-libya-flooding-cnn.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2023-09-17T03:47:00Z",
        "source": {
            "name": "CNN",
            "url": "https://www.cnn.com"
        },
        "id": "171558"
    }
]